{
  "2020-05-02 05:44:39.588349": {
    "target": "bert",
    "model": {
      "BERT": "bert_en_uncased_L-24_H-1024_A-16",
      "BERT_VERSION": 1,
      "BATCH_SIZE": 16,
      "EPOCHS": 4,
      "VERBOSE": 1,
      "OPTIMIZER": "adam",
      "LEARNING_RATE": 2e-06,
      "SHUFFLE": true,
      "VALIDATION_PERCENTAGE": 0.2,
      "INPUT_LENGTH": 82,
      "config": {
        "name": "model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                82
              ],
              "dtype": "int32",
              "sparse": false,
              "ragged": false,
              "name": "input_word_ids"
            },
            "name": "input_word_ids",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                82
              ],
              "dtype": "int32",
              "sparse": false,
              "ragged": false,
              "name": "input_mask"
            },
            "name": "input_mask",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                82
              ],
              "dtype": "int32",
              "sparse": false,
              "ragged": false,
              "name": "segment_ids"
            },
            "name": "segment_ids",
            "inbound_nodes": []
          },
          {
            "class_name": "KerasLayer",
            "config": {
              "name": "keras_layer",
              "trainable": true,
              "dtype": "float32",
              "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_L-24_H-1024_A-16/1"
            },
            "name": "keras_layer",
            "inbound_nodes": [
              [
                [
                  "input_word_ids",
                  0,
                  0,
                  {}
                ],
                [
                  "input_mask",
                  0,
                  0,
                  {}
                ],
                [
                  "segment_ids",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TensorFlowOpLayer",
            "config": {
              "name": "strided_slice",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "strided_slice",
                "op": "StridedSlice",
                "input": [
                  "keras_layer/Identity_1",
                  "strided_slice/begin",
                  "strided_slice/end",
                  "strided_slice/strides"
                ],
                "attr": {
                  "T": {
                    "type": "DT_FLOAT"
                  },
                  "Index": {
                    "type": "DT_INT32"
                  },
                  "shrink_axis_mask": {
                    "i": "2"
                  },
                  "ellipsis_mask": {
                    "i": "0"
                  },
                  "begin_mask": {
                    "i": "5"
                  },
                  "new_axis_mask": {
                    "i": "0"
                  },
                  "end_mask": {
                    "i": "5"
                  }
                }
              },
              "constants": {
                "1": "{\"class_name\": \"ndarray\"}",
                "2": "{\"class_name\": \"ndarray\"}",
                "3": "{\"class_name\": \"ndarray\"}"
              }
            },
            "name": "tf_op_layer_strided_slice",
            "inbound_nodes": [
              [
                [
                  "keras_layer",
                  0,
                  1,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
              [
                [
                  "tf_op_layer_strided_slice",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input_word_ids",
            0,
            0
          ],
          [
            "input_mask",
            0,
            0
          ],
          [
            "segment_ids",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "dense",
            0,
            0
          ]
        ]
      },
      "history": {
        "loss": [
          0.45694,
          0.32326,
          0.24099,
          0.15166
        ],
        "accuracy": [
          0.7936,
          0.8688,
          0.90854,
          0.94795
        ],
        "val_loss": [
          0.39814,
          0.39955,
          0.43019,
          0.48108
        ],
        "val_accuracy": [
          0.82863,
          0.83585,
          0.81747,
          0.81484
        ],
        "test_loss": [
          0.40751,
          0.40058,
          0.42026,
          0.46125
        ],
        "test_accuracy": [
          0.82531,
          0.8342,
          0.82531,
          0.81459
        ]
      }
    }
  }
}