{"2020-04-08 13:17:32.080257": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 8504, "tweets_for_vocabulary_base": true, "shuffle_data": false}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 8504, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.7596848607063293, 0.7754431962966919, 0.8030203580856323, 0.8161523342132568, 0.8174655437469482, 0.8273144960403442, 0.8279711008071899, 0.8260012865066528, 0.8240315318107605, 0.8305975198745728, 0.8161523342132568, 0.818122148513794, 0.8200919032096863, 0.8174655437469482, 0.8174655437469482, 0.8128693103790283, 0.8141825199127197, 0.8069599270820618, 0.8128693103790283, 0.8056467771530151], "epochs": 20, "embedding_dim": 256, "input_len": 23, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 13:27:21.136875": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 8504, "tweets_for_vocabulary_base": true, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 8504, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.7034120559692383, 0.7828084230422974, 0.7959317564964294, 0.81561678647995, 0.8162729740142822, 0.8103674650192261, 0.8162729740142822, 0.819553792476654, 0.8116797804832458, 0.806430459022522, 0.8051180839538574, 0.8103674650192261, 0.8090550899505615, 0.8097112774848938, 0.8070865869522095, 0.806430459022522, 0.8031495809555054, 0.8024934530258179, 0.7972440719604492, 0.7965879440307617], "epochs": 20, "embedding_dim": 256, "input_len": 23, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 13:28:20.352496": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 8504, "tweets_for_vocabulary_base": true, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 8504, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.7467191815376282, 0.7913385629653931, 0.8162729740142822, 0.8202099800109863, 0.8300524950027466, 0.8293963074684143, 0.8313648104667664, 0.8287401795387268, 0.8254593014717102, 0.8267716765403748, 0.8215222954750061, 0.8248031735420227, 0.8202099800109863, 0.81561678647995, 0.8169291615486145, 0.8123359680175781, 0.8110235929489136, 0.8070865869522095, 0.8077427744865417, 0.8097112774848938], "epochs": 20, "embedding_dim": 256, "input_len": 23, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 13:29:09.933354": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 8504, "tweets_for_vocabulary_base": true, "shuffle_data": false}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 8504, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.760998010635376, 0.7826657891273499, 0.7925148010253906, 0.8122127652168274, 0.8214051127433777, 0.8187787532806396, 0.8246881365776062, 0.8233749270439148, 0.8187787532806396, 0.8220617175102234, 0.820748507976532, 0.8154957294464111, 0.813525915145874, 0.8154957294464111, 0.8122127652168274, 0.8102429509162903, 0.8095863461494446, 0.8082731366157532, 0.8089297413825989, 0.8049901723861694], "epochs": 20, "embedding_dim": 256, "input_len": 23, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 13:29:56.605085": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 8504, "tweets_for_vocabulary_base": true, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 8504, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.7493438124656677, 0.7755905389785767, 0.7946194410324097, 0.8149606585502625, 0.8248031735420227, 0.8287401795387268, 0.8307086825370789, 0.8300524950027466, 0.8267716765403748, 0.8287401795387268, 0.8261154890060425, 0.8287401795387268, 0.8248031735420227, 0.8248031735420227, 0.8208661675453186, 0.8202099800109863, 0.8182414770126343, 0.8162729740142822, 0.8116797804832458, 0.8103674650192261], "epochs": 20, "embedding_dim": 256, "input_len": 23, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 13:31:13.833650": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 8504, "tweets_for_vocabulary_base": true, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 8], "dtype": "float32", "input_dim": 8504, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 8}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.7545931935310364, 0.7709974050521851, 0.7847769260406494, 0.7952755689620972, 0.8031495809555054, 0.8123359680175781, 0.808398962020874, 0.8070865869522095, 0.8057742714881897, 0.8057742714881897, 0.8057742714881897, 0.8057742714881897, 0.8038057684898376, 0.8077427744865417, 0.808398962020874, 0.8051180839538574, 0.8024934530258179, 0.8005249500274658, 0.7998687624931335, 0.7959317564964294], "epochs": 20, "embedding_dim": 256, "input_len": 8, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 13:31:41.726426": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 8504, "tweets_for_vocabulary_base": true, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 12], "dtype": "float32", "input_dim": 8504, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 12}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.7185039520263672, 0.7703412175178528, 0.7939632534980774, 0.8038057684898376, 0.8090550899505615, 0.8123359680175781, 0.8143044710159302, 0.8123359680175781, 0.8077427744865417, 0.8090550899505615, 0.8149606585502625, 0.8077427744865417, 0.8051180839538574, 0.8005249500274658, 0.7998687624931335, 0.7972440719604492, 0.7926509380340576, 0.7972440719604492, 0.7933070659637451, 0.7946194410324097], "epochs": 20, "embedding_dim": 256, "input_len": 12, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 13:32:28.300614": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 8504, "tweets_for_vocabulary_base": true, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 8504, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.7618110179901123, 0.7814960479736328, 0.8090550899505615, 0.8254593014717102, 0.819553792476654, 0.8254593014717102, 0.8261154890060425, 0.8241469860076904, 0.81561678647995, 0.8234907984733582, 0.819553792476654, 0.8143044710159302, 0.8202099800109863, 0.8149606585502625, 0.8097112774848938, 0.8011810779571533, 0.8005249500274658, 0.8038057684898376, 0.8044619560241699, 0.7887139320373535], "epochs": 20, "embedding_dim": 256, "input_len": 50, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 13:32:58.610600": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 8504, "tweets_for_vocabulary_base": true, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 15], "dtype": "float32", "input_dim": 8504, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 15}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.7493438124656677, 0.780183732509613, 0.8038057684898376, 0.8103674650192261, 0.8202099800109863, 0.8234907984733582, 0.8287401795387268, 0.8274278044700623, 0.8274278044700623, 0.8267716765403748, 0.8215222954750061, 0.8182414770126343, 0.8202099800109863, 0.8169291615486145, 0.8149606585502625, 0.81561678647995, 0.81561678647995, 0.8090550899505615, 0.8051180839538574, 0.8077427744865417], "epochs": 20, "embedding_dim": 256, "input_len": 15, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 13:33:45.735756": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 8504, "tweets_for_vocabulary_base": true, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 8504, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.7604987025260925, 0.8051180839538574, 0.8221784830093384, 0.8149606585502625, 0.8182414770126343, 0.8188976645469666, 0.8136482834815979, 0.8038057684898376, 0.8129921555519104, 0.808398962020874, 0.8090550899505615, 0.8024934530258179, 0.8031495809555054, 0.7972440719604492, 0.8038057684898376, 0.7952755689620972, 0.7906824350357056, 0.787401556968689, 0.7887139320373535, 0.7867454290390015], "epochs": 20, "embedding_dim": 256, "input_len": 23, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 13:35:38.407349": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 15360, "tweets_for_vocabulary_base": null, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 25], "dtype": "float32", "input_dim": 15360, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5754593014717102, 0.6830708384513855, 0.7185039520263672, 0.7362204790115356, 0.748031497001648, 0.7604987025260925, 0.7709974050521851, 0.7755905389785767, 0.7867454290390015, 0.7900262475013733, 0.7906824350357056, 0.7939632534980774, 0.7906824350357056, 0.7965879440307617, 0.7867454290390015, 0.7906824350357056, 0.7854330539703369, 0.7867454290390015, 0.787401556968689, 0.780183732509613], "epochs": 20, "embedding_dim": 64, "input_len": 25, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 13:36:16.401718": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 15360, "tweets_for_vocabulary_base": null, "shuffle_data": false}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 25], "dtype": "float32", "input_dim": 15360, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5449770092964172, 0.6211425065994263, 0.7078135013580322, 0.734734058380127, 0.7649376392364502, 0.7695338129997253, 0.7754431962966919, 0.7787262201309204, 0.7826657891273499, 0.7866053581237793, 0.7793828248977661, 0.7813525795936584, 0.7780696153640747, 0.7806959748268127, 0.7787262201309204, 0.7754431962966919, 0.777413010597229, 0.7760998010635376, 0.7780696153640747, 0.7708470225334167], "epochs": 20, "embedding_dim": 64, "input_len": 25, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 17:14:02.667874": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 15360, "tweets_for_vocabulary_base": null, "shuffle_data": false}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 25], "dtype": "float32", "input_dim": 15360, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 25}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5344714522361755, 0.5351280570030212, 0.562048614025116, 0.6034142971038818, 0.6828627586364746, 0.75114905834198, 0.7649376392364502, 0.7734733819961548, 0.787261962890625, 0.7925148010253906, 0.7918581962585449, 0.794484555721283, 0.7931713461875916, 0.7905449867248535, 0.7879185676574707, 0.7898883819580078, 0.7833223938941956, 0.7806959748268127, 0.7859488129615784, 0.7879185676574707], "epochs": 20, "embedding_dim": 64, "input_len": 25, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 17:14:51.870511": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 8504, "tweets_for_vocabulary_base": true, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 8504, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5715222954750061, 0.584645688533783, 0.6377952694892883, 0.6922572255134583, 0.7185039520263672, 0.7585301995277405, 0.778215229511261, 0.7906824350357056, 0.8057742714881897, 0.806430459022522, 0.8038057684898376, 0.8031495809555054, 0.8024934530258179, 0.806430459022522, 0.8038057684898376, 0.8051180839538574, 0.8005249500274658, 0.8024934530258179, 0.7985564470291138, 0.7972440719604492], "epochs": 20, "embedding_dim": 64, "input_len": 23, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 17:15:28.549312": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 8504, "tweets_for_vocabulary_base": true, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 8504, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5702099800109863, 0.5702099800109863, 0.5702099800109863, 0.5708661675453186, 0.5728346705436707, 0.5826771855354309, 0.5990813374519348, 0.6207349300384521, 0.6397637724876404, 0.6535432934761047, 0.6797900199890137, 0.6961942315101624, 0.7047244310379028, 0.7270340919494629, 0.7395012974739075, 0.7447506785392761, 0.7454068064689636, 0.7545931935310364, 0.759186327457428, 0.7670603394508362], "epochs": 20, "embedding_dim": 16, "input_len": 23, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 17:16:19.528019": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 8504, "tweets_for_vocabulary_base": true, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 8504, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5702099800109863, 0.5708661675453186, 0.5721784830093384, 0.5761154890060425, 0.5853018164634705, 0.6003937125205994, 0.6220472455024719, 0.6509186625480652, 0.6745406985282898, 0.6988189220428467, 0.7112860679626465, 0.7191600799560547, 0.7322834730148315, 0.7440944910049438, 0.7572178244590759, 0.7539370059967041, 0.7637795209884644, 0.7762467265129089, 0.7795275449752808, 0.778215229511261, 0.7900262475013733, 0.7926509380340576, 0.7926509380340576, 0.7979002594947815, 0.7939632534980774, 0.7992125749588013, 0.7965879440307617, 0.7979002594947815, 0.7965879440307617, 0.7992125749588013, 0.8011810779571533, 0.7992125749588013, 0.8097112774848938, 0.8090550899505615, 0.808398962020874, 0.808398962020874, 0.8077427744865417, 0.8097112774848938, 0.8044619560241699, 0.806430459022522, 0.8077427744865417, 0.806430459022522, 0.8057742714881897, 0.8044619560241699, 0.8057742714881897, 0.8044619560241699, 0.8018372654914856, 0.8011810779571533, 0.7985564470291138, 0.7952755689620972], "epochs": 50, "embedding_dim": 16, "input_len": 23, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 17:16:50.693448": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 15360, "tweets_for_vocabulary_base": null, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 25], "dtype": "float32", "input_dim": 15360, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 25}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5734907984733582, 0.5984252095222473, 0.6227034330368042, 0.6443569660186768, 0.6725721955299377, 0.6883202195167542, 0.7270340919494629, 0.7552493214607239, 0.7604987025260925, 0.7657480239868164, 0.7690288424491882, 0.7795275449752808, 0.789370059967041, 0.7926509380340576, 0.7926509380340576, 0.7919947504997253, 0.7939632534980774, 0.7919947504997253, 0.7860892415046692, 0.7880577445030212, 0.7933070659637451, 0.7939632534980774, 0.789370059967041, 0.7926509380340576, 0.7939632534980774, 0.7939632534980774, 0.7926509380340576, 0.7926509380340576, 0.7880577445030212, 0.7998687624931335, 0.7933070659637451, 0.7860892415046692, 0.7952755689620972, 0.789370059967041, 0.7985564470291138, 0.7900262475013733, 0.7919947504997253, 0.7900262475013733, 0.7919947504997253, 0.7913385629653931, 0.789370059967041, 0.7887139320373535, 0.789370059967041, 0.7906824350357056, 0.7821522355079651, 0.787401556968689, 0.7880577445030212, 0.7867454290390015, 0.7880577445030212, 0.7841207385063171], "epochs": 50, "embedding_dim": 16, "input_len": 25, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 17:17:46.711548": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": true, "train_percentage": 0.8, "vocabulary_len": 15360, "tweets_for_vocabulary_base": null, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 25], "dtype": "float32", "input_dim": 15360, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 25}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5774278044700623, 0.5898950099945068, 0.6082677245140076, 0.6292650699615479, 0.6509186625480652, 0.6830708384513855, 0.7007874250411987, 0.7099737524986267, 0.7427821755409241, 0.7454068064689636, 0.7723097205162048, 0.7788714170455933, 0.787401556968689, 0.7959317564964294, 0.7985564470291138, 0.8097112774848938, 0.8129921555519104, 0.8143044710159302, 0.8149606585502625, 0.8143044710159302, 0.8169291615486145, 0.8162729740142822, 0.81561678647995, 0.8136482834815979, 0.81561678647995, 0.81561678647995, 0.8129921555519104, 0.8129921555519104, 0.8123359680175781, 0.8123359680175781, 0.8129921555519104, 0.8136482834815979, 0.8116797804832458, 0.8070865869522095, 0.8005249500274658, 0.8051180839538574, 0.8057742714881897, 0.8110235929489136, 0.8038057684898376, 0.8024934530258179, 0.806430459022522, 0.808398962020874, 0.8044619560241699, 0.7992125749588013, 0.8011810779571533, 0.8031495809555054, 0.8018372654914856, 0.7998687624931335, 0.7998687624931335, 0.7965879440307617], "epochs": 50, "embedding_dim": 32, "input_len": 25, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 17:18:48.480207": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": false, "train_percentage": 0.8, "vocabulary_len": 15359, "tweets_for_vocabulary_base": null, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 25], "dtype": "float32", "input_dim": 15359, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 25}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5702099800109863, 0.5708661675453186, 0.5734907984733582, 0.5892388224601746, 0.6076115369796753, 0.6423884630203247, 0.6732283234596252, 0.7001312375068665, 0.7020997405052185, 0.7250655889511108, 0.75, 0.7690288424491882, 0.7749344110488892, 0.7762467265129089, 0.7775590419769287, 0.7900262475013733, 0.7919947504997253, 0.7900262475013733, 0.7887139320373535, 0.7887139320373535, 0.7880577445030212, 0.789370059967041, 0.7900262475013733, 0.789370059967041, 0.7880577445030212, 0.7880577445030212, 0.7860892415046692, 0.7867454290390015, 0.7860892415046692, 0.7860892415046692], "epochs": 30, "embedding_dim": 32, "input_len": 25, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 17:40:14.765262": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": false, "train_percentage": 0.8, "vocabulary_len": 15359, "tweets_for_vocabulary_base": null, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 25], "dtype": "float32", "input_dim": 15359, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.6108924150466919, 0.586614191532135, 0.5872703194618225, 0.5912073254585266, 0.6089239120483398, 0.6384514570236206, 0.6679790019989014, 0.6994750499725342, 0.7158792614936829, 0.7283464670181274, 0.7414698004722595, 0.7454068064689636, 0.7486876845359802, 0.7559055089950562, 0.7552493214607239, 0.7572178244590759, 0.7618110179901123, 0.7644357085227966, 0.7736220359802246, 0.7769029140472412, 0.780183732509613, 0.7808399200439453, 0.7828084230422974, 0.7808399200439453, 0.7814960479736328, 0.7854330539703369, 0.7854330539703369, 0.7854330539703369, 0.7860892415046692, 0.787401556968689], "epochs": 30, "embedding_dim": 8, "input_len": 25, "batch_size": 512, "optimizer": "rmsprop"}}, "2020-04-08 17:40:45.710183": {"data": {"preprocess_options": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": false, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}, "words_reputation_filter": 0, "add_start_symbol": false, "train_percentage": 0.8, "vocabulary_len": 15359, "tweets_for_vocabulary_base": null, "shuffle_data": true}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 25], "dtype": "float32", "input_dim": 15359, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, 