{
  "2020-04-30 05:43:15.596333": {
    "file": "app_bert.py",
    "model": {
      "BERT": "bert_en_uncased_L-24_H-1024_A-16",
      "BATCH_SIZE": 16,
      "EPOCHS": 4,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 2e-06,
      "SHUFFLE": true,
      "VALIDATION_PERCENTAGE": 0.2,
      "config": {
        "name": "model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                84
              ],
              "dtype": "int32",
              "sparse": false,
              "ragged": false,
              "name": "input_word_ids"
            },
            "name": "input_word_ids",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                84
              ],
              "dtype": "int32",
              "sparse": false,
              "ragged": false,
              "name": "input_mask"
            },
            "name": "input_mask",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                84
              ],
              "dtype": "int32",
              "sparse": false,
              "ragged": false,
              "name": "segment_ids"
            },
            "name": "segment_ids",
            "inbound_nodes": []
          },
          {
            "class_name": "KerasLayer",
            "config": {
              "name": "keras_layer",
              "trainable": true,
              "dtype": "float32",
              "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_L-24_H-1024_A-16/2"
            },
            "name": "keras_layer",
            "inbound_nodes": [
              [
                [
                  "input_word_ids",
                  0,
                  0,
                  {}
                ],
                [
                  "input_mask",
                  0,
                  0,
                  {}
                ],
                [
                  "segment_ids",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TensorFlowOpLayer",
            "config": {
              "name": "strided_slice",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "strided_slice",
                "op": "StridedSlice",
                "input": [
                  "keras_layer/Identity_1",
                  "strided_slice/begin",
                  "strided_slice/end",
                  "strided_slice/strides"
                ],
                "attr": {
                  "shrink_axis_mask": {
                    "i": "2"
                  },
                  "ellipsis_mask": {
                    "i": "0"
                  },
                  "begin_mask": {
                    "i": "5"
                  },
                  "new_axis_mask": {
                    "i": "0"
                  },
                  "end_mask": {
                    "i": "5"
                  },
                  "T": {
                    "type": "DT_FLOAT"
                  },
                  "Index": {
                    "type": "DT_INT32"
                  }
                }
              },
              "constants": {
                "1": "{\"class_name\": \"ndarray\"}",
                "2": "{\"class_name\": \"ndarray\"}",
                "3": "{\"class_name\": \"ndarray\"}"
              }
            },
            "name": "tf_op_layer_strided_slice",
            "inbound_nodes": [
              [
                [
                  "keras_layer",
                  0,
                  1,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
              [
                [
                  "tf_op_layer_strided_slice",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input_word_ids",
            0,
            0
          ],
          [
            "input_mask",
            0,
            0
          ],
          [
            "segment_ids",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "dense",
            0,
            0
          ]
        ]
      },
      "history": {
        "loss": [
          0.49357,
          0.37975,
          0.34368,
          0.30785
        ],
        "accuracy": [
          0.77192,
          0.84187,
          0.86141,
          0.87209
        ],
        "val_loss": [
          0.39405,
          0.41694,
          0.4008,
          0.40696
        ],
        "val_accuracy": [
          0.83913,
          0.82534,
          0.83782,
          0.84307
        ],
        "test_loss": [
          0.41417,
          0.41555,
          0.39682,
          0.39645
        ],
        "test_accuracy": [
          0.82439,
          0.82102,
          0.83819,
          0.84278
        ]
      }
    }
  },
  "2020-04-30 10:10:17.954764": {
    "file": "app_bert.py",
    "model": {
      "BERT": "bert_en_uncased_L-12_H-768_A-12",
      "BATCH_SIZE": 16,
      "EPOCHS": 4,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 2e-06,
      "SHUFFLE": true,
      "VALIDATION_PERCENTAGE": 0.2,
      "config": {
        "name": "model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                84
              ],
              "dtype": "int32",
              "sparse": false,
              "ragged": false,
              "name": "input_word_ids"
            },
            "name": "input_word_ids",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                84
              ],
              "dtype": "int32",
              "sparse": false,
              "ragged": false,
              "name": "input_mask"
            },
            "name": "input_mask",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                84
              ],
              "dtype": "int32",
              "sparse": false,
              "ragged": false,
              "name": "segment_ids"
            },
            "name": "segment_ids",
            "inbound_nodes": []
          },
          {
            "class_name": "KerasLayer",
            "config": {
              "name": "keras_layer",
              "trainable": true,
              "dtype": "float32",
              "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_L-12_H-768_A-12/2"
            },
            "name": "keras_layer",
            "inbound_nodes": [
              [
                [
                  "input_word_ids",
                  0,
                  0,
                  {}
                ],
                [
                  "input_mask",
                  0,
                  0,
                  {}
                ],
                [
                  "segment_ids",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TensorFlowOpLayer",
            "config": {
              "name": "strided_slice",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "strided_slice",
                "op": "StridedSlice",
                "input": [
                  "keras_layer/Identity_1",
                  "strided_slice/begin",
                  "strided_slice/end",
                  "strided_slice/strides"
                ],
                "attr": {
                  "Index": {
                    "type": "DT_INT32"
                  },
                  "T": {
                    "type": "DT_FLOAT"
                  },
                  "shrink_axis_mask": {
                    "i": "2"
                  },
                  "begin_mask": {
                    "i": "5"
                  },
                  "ellipsis_mask": {
                    "i": "0"
                  },
                  "new_axis_mask": {
                    "i": "0"
                  },
                  "end_mask": {
                    "i": "5"
                  }
                }
              },
              "constants": {
                "1": "{\"class_name\": \"ndarray\"}",
                "2": "{\"class_name\": \"ndarray\"}",
                "3": "{\"class_name\": \"ndarray\"}"
              }
            },
            "name": "tf_op_layer_strided_slice",
            "inbound_nodes": [
              [
                [
                  "keras_layer",
                  0,
                  1,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
              [
                [
                  "tf_op_layer_strided_slice",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input_word_ids",
            0,
            0
          ],
          [
            "input_mask",
            0,
            0
          ],
          [
            "segment_ids",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "dense",
            0,
            0
          ]
        ]
      },
      "history": {
        "loss": [
          0.53214,
          0.41313,
          0.36912,
          0.34817
        ],
        "accuracy": [
          0.74154,
          0.81888,
          0.84877,
          0.85632
        ],
        "val_loss": [
          0.42064,
          0.39618,
          0.3836,
          0.38218
        ],
        "val_accuracy": [
          0.82075,
          0.82928,
          0.83585,
          0.83979
        ],
        "test_loss": [
          0.44149,
          0.41693,
          0.40361,
          0.39909
        ],
        "test_accuracy": [
          0.80907,
          0.81275,
          0.83298,
          0.83573
        ]
      }
    }
  },
  "2020-04-30 11:16:01.959519": {
    "file": "app_keras.py",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": false,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": false,
        "remove_not_alpha": true,
        "join": false
      },
      "GLOVE_SIZE": 100,
      "GLOVE": "glove.twitter.27B.100d.txt"
    },
    "model": {
      "BATCH_SIZE": 32,
      "EPOCHS": 15,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13985,
        "output_dim": 100,
        "input_length": 35,
        "embeddings_initializer": "{\"class_name\": \"Constant\"}",
        "trainable": false
      },
      "VALIDATION_PERCENTAGE": 0.2,
      "TYPE": "FASTTEXT",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": false,
              "batch_input_shape": [
                null,
                35
              ],
              "dtype": "float32",
              "input_dim": 13985,
              "output_dim": 100,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "{\"class_name\": \"ndarray\"}"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 35
            }
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.67025,
          0.64621,
          0.62303,
          0.60116,
          0.58174,
          0.56457,
          0.54995,
          0.53715,
          0.52612,
          0.51638,
          0.50754,
          0.49989,
          0.49312,
          0.48697,
          0.48183
        ],
        "accuracy": [
          0.58391,
          0.63596,
          0.71609,
          0.74565,
          0.75583,
          0.76273,
          0.76585,
          0.77011,
          0.77438,
          0.7775,
          0.7775,
          0.77964,
          0.78194,
          0.78456,
          0.78719
        ],
        "val_loss": [
          0.66576,
          0.63612,
          0.60908,
          0.58485,
          0.56396,
          0.54641,
          0.53127,
          0.51846,
          0.50828,
          0.49819,
          0.48928,
          0.4823,
          0.47637,
          0.46967,
          0.4653
        ],
        "val_accuracy": [
          0.56008,
          0.66842,
          0.75772,
          0.76625,
          0.77676,
          0.78201,
          0.78529,
          0.78858,
          0.78989,
          0.79383,
          0.79645,
          0.79908,
          0.80171,
          0.80499,
          0.80565
        ],
        "test_loss": [
          0.66272,
          0.63941,
          0.61764,
          0.5978,
          0.58053,
          0.56592,
          0.55321,
          0.54225,
          0.53339,
          0.52474,
          0.5171,
          0.51102,
          0.50592,
          0.50001,
          0.49631
        ],
        "test_accuracy": [
          0.58014,
          0.66411,
          0.72142,
          0.74287,
          0.75176,
          0.75759,
          0.76494,
          0.76984,
          0.76709,
          0.76984,
          0.77321,
          0.77352,
          0.77567,
          0.77842,
          0.78241
        ]
      }
    }
  },
  "2020-04-30 11:17:49.597108": {
    "file": "app_keras.py",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": false,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": false,
        "remove_not_alpha": true,
        "join": false
      },
      "GLOVE_SIZE": 100,
      "GLOVE": "glove.twitter.27B.100d.txt"
    },
    "model": {
      "BATCH_SIZE": 8,
      "EPOCHS": 15,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13985,
        "output_dim": 100,
        "input_length": 35,
        "embeddings_initializer": "{\"class_name\": \"Constant\"}",
        "trainable": false
      },
      "VALIDATION_PERCENTAGE": 0.2,
      "TYPE": "FASTTEXT",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": false,
              "batch_input_shape": [
                null,
                35
              ],
              "dtype": "float32",
              "input_dim": 13985,
              "output_dim": 100,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "{\"class_name\": \"ndarray\"}"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 35
            }
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 50,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.64434,
          0.57759,
          0.53585,
          0.5095,
          0.49175,
          0.47919,
          0.46985,
          0.46277,
          0.45723,
          0.45272,
          0.44933,
          0.44641,
          0.4442,
          0.44201,
          0.44036
        ],
        "accuracy": [
          0.69606,
          0.76765,
          0.77668,
          0.78227,
          0.78686,
          0.79278,
          0.79507,
          0.79704,
          0.8,
          0.79967,
          0.80197,
          0.80213,
          0.80361,
          0.8046,
          0.80509
        ],
        "val_loss": [
          0.60694,
          0.54761,
          0.50933,
          0.49005,
          0.47343,
          0.46114,
          0.45301,
          0.44624,
          0.44123,
          0.43606,
          0.43402,
          0.43001,
          0.42778,
          0.4272,
          0.42538
        ],
        "val_accuracy": [
          0.75312,
          0.7761,
          0.78529,
          0.79186,
          0.79711,
          0.7912,
          0.79711,
          0.79514,
          0.79777,
          0.79974,
          0.79711,
          0.80368,
          0.80499,
          0.80236,
          0.80762
        ],
        "test_loss": [
          0.6127,
          0.56368,
          0.53239,
          0.51605,
          0.50208,
          0.49161,
          0.48497,
          0.47962,
          0.47568,
          0.47063,
          0.47016,
          0.46625,
          0.46451,
          0.46543,
          0.46402
        ],
        "test_accuracy": [
          0.73092,
          0.76004,
          0.77076,
          0.768,
          0.77444,
          0.78118,
          0.78486,
          0.78609,
          0.78731,
          0.7913,
          0.79038,
          0.79375,
          0.79283,
          0.79283,
          0.79405
        ]
      }
    }
  },
  "2020-04-30 11:20:12.689022": {
    "file": "app_keras.py",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": false,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": false,
        "remove_not_alpha": true,
        "join": false
      },
      "GLOVE_SIZE": 100,
      "GLOVE": "glove.twitter.27B.100d.txt"
    },
    "model": {
      "BATCH_SIZE": 8,
      "EPOCHS": 30,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13985,
        "output_dim": 100,
        "input_length": 35,
        "embeddings_initializer": "{\"class_name\": \"Constant\"}",
        "trainable": false
      },
      "VALIDATION_PERCENTAGE": 0.2,
      "TYPE": "FASTTEXT",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": false,
              "batch_input_shape": [
                null,
                35
              ],
              "dtype": "float32",
              "input_dim": 13985,
              "output_dim": 100,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "{\"class_name\": \"ndarray\"}"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 35
            }
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 50,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.6377,
          0.57478,
          0.53499,
          0.5093,
          0.49242,
          0.47993,
          0.47085,
          0.46358,
          0.4579,
          0.4532,
          0.44953,
          0.44657,
          0.44395,
          0.44221,
          0.44049,
          0.43886,
          0.43739,
          0.43623,
          0.43529,
          0.43417,
          0.43336,
          0.43269,
          0.43188,
          0.43101,
          0.43066,
          0.4297,
          0.42931,
          0.42872,
          0.42828,
          0.42764
        ],
        "accuracy": [
          0.68243,
          0.76125,
          0.77291,
          0.78112,
          0.78801,
          0.79245,
          0.79294,
          0.79852,
          0.79918,
          0.80164,
          0.80246,
          0.80345,
          0.80361,
          0.80525,
          0.80673,
          0.80608,
          0.80706,
          0.80673,
          0.80624,
          0.80805,
          0.80952,
          0.8092,
          0.80952,
          0.8092,
          0.80903,
          0.80969,
          0.80969,
          0.8087,
          0.81067,
          0.81067
        ],
        "val_loss": [
          0.59326,
          0.53751,
          0.50431,
          0.48587,
          0.46986,
          0.46011,
          0.45025,
          0.44548,
          0.43967,
          0.43544,
          0.43297,
          0.43103,
          0.42874,
          0.4263,
          0.42386,
          0.42222,
          0.4211,
          0.42006,
          0.41945,
          0.41832,
          0.41867,
          0.4171,
          0.41626,
          0.4157,
          0.41538,
          0.41487,
          0.41431,
          0.41436,
          0.41421,
          0.41394
        ],
        "val_accuracy": [
          0.75837,
          0.78267,
          0.7912,
          0.7958,
          0.79711,
          0.80302,
          0.79908,
          0.7958,
          0.80302,
          0.80696,
          0.80499,
          0.80565,
          0.8063,
          0.80762,
          0.80827,
          0.81156,
          0.81156,
          0.81156,
          0.81221,
          0.81156,
          0.81221,
          0.81156,
          0.80959,
          0.80959,
          0.81156,
          0.81221,
          0.81024,
          0.81221,
          0.81287,
          0.81287
        ],
        "test_loss": [
          0.60625,
          0.56013,
          0.53173,
          0.51541,
          0.50148,
          0.49299,
          0.48424,
          0.48019,
          0.47533,
          0.47165,
          0.46993,
          0.46858,
          0.46693,
          0.46461,
          0.4621,
          0.46061,
          0.45921,
          0.45875,
          0.45866,
          0.45778,
          0.45886,
          0.45709,
          0.45619,
          0.45591,
          0.45552,
          0.45442,
          0.45443,
          0.45484,
          0.45488,
          0.4547
        ],
        "test_accuracy": [
          0.74134,
          0.75789,
          0.76678,
          0.77076,
          0.77475,
          0.7772,
          0.78486,
          0.78578,
          0.79099,
          0.79191,
          0.79344,
          0.79405,
          0.79436,
          0.79344,
          0.79559,
          0.79743,
          0.7962,
          0.79528,
          0.79528,
          0.79743,
          0.79559,
          0.79681,
          0.7962,
          0.79681,
          0.79528,
          0.79528,
          0.79804,
          0.79436,
          0.79467,
          0.79528
        ]
      }
    }
  },
  "2020-04-30 11:32:47.221430": {
    "file": "app_keras.py",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": false,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": false,
        "remove_not_alpha": true,
        "join": false
      },
      "GLOVE_SIZE": 100,
      "GLOVE": "glove.twitter.27B.100d.txt"
    },
    "model": {
      "BATCH_SIZE": 32,
      "EPOCHS": 30,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13985,
        "output_dim": 100,
        "input_length": 35,
        "embeddings_initializer": "{\"class_name\": \"Constant\"}",
        "trainable": false
      },
      "VALIDATION_PERCENTAGE": 0.2,
      "TYPE": "FASTTEXT",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": false,
              "batch_input_shape": [
                null,
                35
              ],
              "dtype": "float32",
              "input_dim": 13985,
              "output_dim": 100,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "{\"class_name\": \"ndarray\"}"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 35
            }
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 50,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.57717,
          0.47738,
          0.45081,
          0.44012,
          0.4335,
          0.43077,
          0.42643,
          0.42354,
          0.42162,
          0.41921,
          0.41602,
          0.4142,
          0.41239,
          0.40956,
          0.40797,
          0.40564,
          0.40381,
          0.40209,
          0.40015,
          0.39841,
          0.39663,
          0.39421,
          0.3928,
          0.39105,
          0.38938,
          0.38732,
          0.38626,
          0.38482,
          0.38292,
          0.38146
        ],
        "accuracy": [
          0.73514,
          0.78851,
          0.79967,
          0.80443,
          0.80624,
          0.80952,
          0.81281,
          0.81084,
          0.81527,
          0.81593,
          0.81806,
          0.81675,
          0.82003,
          0.82266,
          0.82053,
          0.82447,
          0.82381,
          0.82611,
          0.82414,
          0.82677,
          0.82693,
          0.8266,
          0.82874,
          0.83136,
          0.83005,
          0.83399,
          0.83284,
          0.83383,
          0.83465,
          0.83514
        ],
        "val_loss": [
          0.49308,
          0.44634,
          0.42602,
          0.42089,
          0.42289,
          0.41413,
          0.41146,
          0.41158,
          0.40971,
          0.40915,
          0.40842,
          0.40914,
          0.40986,
          0.41046,
          0.40713,
          0.40816,
          0.40844,
          0.40727,
          0.40802,
          0.40887,
          0.41411,
          0.40876,
          0.40848,
          0.4093,
          0.40972,
          0.4085,
          0.41016,
          0.41162,
          0.41307,
          0.41178
        ],
        "val_accuracy": [
          0.78989,
          0.79908,
          0.80959,
          0.80696,
          0.80499,
          0.81353,
          0.81221,
          0.81484,
          0.81287,
          0.81747,
          0.82009,
          0.81287,
          0.81156,
          0.81747,
          0.82009,
          0.81287,
          0.82009,
          0.81878,
          0.80959,
          0.81287,
          0.81156,
          0.81681,
          0.81221,
          0.81156,
          0.81353,
          0.81353,
          0.81747,
          0.81681,
          0.81156,
          0.81418
        ],
        "test_loss": [
          0.51806,
          0.47999,
          0.46211,
          0.45846,
          0.46545,
          0.45407,
          0.45034,
          0.45218,
          0.44906,
          0.44635,
          0.44636,
          0.44735,
          0.44912,
          0.44639,
          0.44269,
          0.4451,
          0.44181,
          0.44151,
          0.44369,
          0.4449,
          0.44279,
          0.44021,
          0.44044,
          0.44316,
          0.44126,
          0.44065,
          0.43976,
          0.44003,
          0.44544,
          0.44138
        ],
        "test_accuracy": [
          0.77046,
          0.78578,
          0.79497,
          0.79651,
          0.7913,
          0.79773,
          0.79896,
          0.79681,
          0.80049,
          0.79865,
          0.80202,
          0.79957,
          0.8008,
          0.80325,
          0.80386,
          0.80356,
          0.80539,
          0.80693,
          0.80386,
          0.8057,
          0.8011,
          0.80846,
          0.80601,
          0.80723,
          0.80693,
          0.80846,
          0.80846,
          0.80662,
          0.8057,
          0.80723
        ]
      }
    }
  },
  "2020-04-30 11:39:21.281016": {
    "file": "app_keras.py",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": false,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": false,
        "remove_not_alpha": true,
        "join": false
      },
      "GLOVE_SIZE": 100,
      "GLOVE": "glove.twitter.27B.100d.txt"
    },
    "model": {
      "BATCH_SIZE": 8,
      "EPOCHS": 50,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0002,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13985,
        "output_dim": 100,
        "input_length": 35,
        "embeddings_initializer": "{\"class_name\": \"Constant\"}",
        "trainable": false
      },
      "VALIDATION_PERCENTAGE": 0.2,
      "TYPE": "FASTTEXT",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": false,
              "batch_input_shape": [
                null,
                35
              ],
              "dtype": "float32",
              "input_dim": 13985,
              "output_dim": 100,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "{\"class_name\": \"ndarray\"}"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 35
            }
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 50,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.61792,
          0.52981,
          0.49163,
          0.4713,
          0.45916,
          0.45157,
          0.44639,
          0.44249,
          0.43997,
          0.43757,
          0.43603,
          0.43452,
          0.43321,
          0.43252,
          0.43087,
          0.43015,
          0.4296,
          0.42867,
          0.42792,
          0.42655,
          0.4264,
          0.42558,
          0.42457,
          0.42356,
          0.42306,
          0.42219,
          0.42128,
          0.42066,
          0.41976,
          0.41901,
          0.41829,
          0.41787,
          0.41687,
          0.41642,
          0.41566,
          0.41496,
          0.41431,
          0.41381,
          0.41303,
          0.41252,
          0.41169,
          0.41133,
          0.41052,
          0.40992,
          0.40931,
          0.4084,
          0.40801,
          0.4072,
          0.40639,
          0.40633
        ],
        "accuracy": [
          0.72956,
          0.77455,
          0.78752,
          0.79392,
          0.79787,
          0.79918,
          0.8023,
          0.80296,
          0.80673,
          0.80772,
          0.80608,
          0.80739,
          0.80788,
          0.80854,
          0.80936,
          0.80837,
          0.81084,
          0.81232,
          0.81117,
          0.81182,
          0.81264,
          0.81314,
          0.81248,
          0.81232,
          0.81346,
          0.8156,
          0.81445,
          0.81461,
          0.81544,
          0.81741,
          0.81675,
          0.81773,
          0.81593,
          0.8197,
          0.81823,
          0.81757,
          0.81855,
          0.81839,
          0.8202,
          0.81905,
          0.81724,
          0.8202,
          0.81905,
          0.82036,
          0.82036,
          0.82003,
          0.81905,
          0.81987,
          0.822,
          0.82085
        ],
        "val_loss": [
          0.54386,
          0.48638,
          0.46,
          0.44625,
          0.43617,
          0.4292,
          0.42531,
          0.42311,
          0.42001,
          0.41895,
          0.41757,
          0.41644,
          0.41683,
          0.4153,
          0.41592,
          0.41396,
          0.41397,
          0.41385,
          0.41316,
          0.41252,
          0.41208,
          0.41274,
          0.41162,
          0.41313,
          0.41106,
          0.41211,
          0.41121,
          0.41111,
          0.41185,
          0.41084,
          0.41091,
          0.41099,
          0.41094,
          0.41095,
          0.41103,
          0.41065,
          0.41108,
          0.41105,
          0.41207,
          0.41164,
          0.41121,
          0.41143,
          0.41089,
          0.41084,
          0.41109,
          0.41185,
          0.41164,
          0.41152,
          0.41178,
          0.41139
        ],
        "val_accuracy": [
          0.77216,
          0.78989,
          0.79711,
          0.79842,
          0.80368,
          0.80762,
          0.80827,
          0.80959,
          0.80827,
          0.81353,
          0.8109,
          0.81221,
          0.81024,
          0.81024,
          0.80959,
          0.81418,
          0.81221,
          0.81156,
          0.81221,
          0.81418,
          0.81353,
          0.81353,
          0.81418,
          0.81221,
          0.81156,
          0.8109,
          0.81287,
          0.81484,
          0.81287,
          0.81484,
          0.8109,
          0.81156,
          0.81353,
          0.81024,
          0.80762,
          0.8109,
          0.81287,
          0.81221,
          0.81418,
          0.81287,
          0.81156,
          0.80959,
          0.81484,
          0.81353,
          0.81156,
          0.81681,
          0.81287,
          0.81287,
          0.81484,
          0.81418
        ],
        "test_loss": [
          0.56722,
          0.5171,
          0.49371,
          0.48239,
          0.47376,
          0.46725,
          0.46443,
          0.46145,
          0.4596,
          0.45978,
          0.45713,
          0.45623,
          0.45596,
          0.45698,
          0.45806,
          0.45473,
          0.45554,
          0.45516,
          0.45356,
          0.45256,
          0.45232,
          0.45355,
          0.4513,
          0.45431,
          0.45081,
          0.4493,
          0.45025,
          0.44908,
          0.45221,
          0.44836,
          0.44793,
          0.44763,
          0.44738,
          0.44732,
          0.44734,
          0.44761,
          0.449,
          0.44794,
          0.44629,
          0.44868,
          0.44637,
          0.44536,
          0.4469,
          0.44602,
          0.44512,
          0.44749,
          0.44443,
          0.44515,
          0.4471,
          0.44533
        ],
        "test_accuracy": [
          0.76034,
          0.77475,
          0.77996,
          0.7818,
          0.79007,
          0.79375,
          0.79436,
          0.79865,
          0.79528,
          0.79344,
          0.79712,
          0.79589,
          0.79589,
          0.79497,
          0.79405,
          0.7962,
          0.79559,
          0.79589,
          0.7962,
          0.7962,
          0.79865,
          0.79589,
          0.79896,
          0.79375,
          0.79926,
          0.79835,
          0.79896,
          0.79896,
          0.79467,
          0.79957,
          0.79804,
          0.79896,
          0.79926,
          0.79773,
          0.79773,
          0.79896,
          0.79773,
          0.79712,
          0.80172,
          0.79712,
          0.80018,
          0.79896,
          0.79926,
          0.8008,
          0.79865,
          0.79651,
          0.80417,
          0.79988,
          0.79926,
          0.80172
        ]
      }
    }
  },
  "2020-04-30 11:44:38.540615": {
    "file": "app_keras.py",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": false,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": false,
        "remove_not_alpha": true,
        "join": false
      },
      "GLOVE_SIZE": 100,
      "GLOVE": "glove.twitter.27B.100d.txt"
    },
    "model": {
      "BATCH_SIZE": 8,
      "EPOCHS": 60,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0002,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
