{
  "2020-04-13 15:42:21.059785": {
    "file": "app_glove.py",
    "data": {
      "GLOVE_SIZE": 50,
      "TRAIN_PERCENTAGE": 0.8,
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 512,
      "EPOCHS": 50,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13820,
        "output_dim": 50,
        "input_length": 23,
        "embeddings_initializer": "Constant",
        "trainable": false
      },
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": false,
              "batch_input_shape": [
                null,
                23
              ],
              "dtype": "float32",
              "input_dim": 13820,
              "output_dim": 50,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "ndarray"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 23
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "val_accuracy": [
        0.6483336091041565,
        0.6837957501411438,
        0.7067804932594299,
        0.717780351638794,
        0.7261533141136169,
        0.731735348701477,
        0.7348546981811523,
        0.7401083707809448,
        0.7435560822486877,
        0.7489739060401917,
        0.7511081695556641,
        0.7530783414840698,
        0.7560334801673889,
        0.759645402431488,
        0.7599737048149109,
        0.7619438767433167,
        0.7626005411148071,
        0.7657198905944824,
        0.7650632262229919,
        0.7665408253669739,
        0.7670333385467529,
        0.7671974897384644,
        0.7686750888824463,
        0.7685109376907349,
        0.7706452012062073,
        0.7716302871704102,
        0.7729436755180359,
        0.7719586491584778,
        0.7749137878417969,
        0.7755705118179321,
        0.7757346630096436,
        0.7760630249977112,
        0.7770481109619141,
        0.7755705118179321,
        0.7763913869857788,
        0.7755705118179321,
        0.7762272357940674,
        0.7755705118179321,
        0.7767197489738464,
        0.7768839001655579,
        0.7777048349380493,
        0.776555597782135,
        0.7791823744773865,
        0.7770481109619141,
        0.778525710105896,
        0.779018223285675,
        0.7788540720939636,
        0.7803316116333008,
        0.7795107364654541,
        0.7795107364654541
      ],
      "test_performance": [
        "64.73%",
        "67.85%",
        "69.32%",
        "70.24%",
        "71.59%",
        "72.57%",
        "73.06%",
        "73.40%",
        "73.89%",
        "74.10%",
        "74.13%",
        "74.20%",
        "74.75%",
        "75.27%",
        "75.27%",
        "75.33%",
        "75.54%",
        "75.79%",
        "76.10%",
        "76.03%",
        "76.25%",
        "76.25%",
        "76.31%",
        "76.40%",
        "76.52%",
        "76.56%",
        "76.65%",
        "76.71%",
        "76.86%",
        "76.86%",
        "77.05%",
        "76.92%",
        "76.95%",
        "76.83%",
        "76.86%",
        "76.83%",
        "76.89%",
        "76.89%",
        "76.98%",
        "77.02%",
        "77.02%",
        "77.08%",
        "77.26%",
        "77.02%",
        "77.20%",
        "77.11%",
        "77.23%",
        "77.20%",
        "77.35%",
        "77.29%"
      ]
    }
  },
  "2020-04-13 15:46:12.393721": {
    "file": "app_glove.py",
    "data": {
      "GLOVE_SIZE": 200,
      "TRAIN_PERCENTAGE": 0.8,
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 512,
      "EPOCHS": 50,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13820,
        "output_dim": 200,
        "input_length": 23,
        "embeddings_initializer": "Constant",
        "trainable": false
      },
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": false,
              "batch_input_shape": [
                null,
                23
              ],
              "dtype": "float32",
              "input_dim": 13820,
              "output_dim": 200,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "ndarray"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 23
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "val_accuracy": [
        0.676900327205658,
        0.7154818773269653,
        0.7322278618812561,
        0.7422426342964172,
        0.7504515051841736,
        0.7578394412994385,
        0.759645402431488,
        0.7673617005348206,
        0.7648990154266357,
        0.76604825258255,
        0.7698243260383606,
        0.7696601748466492,
        0.7734361886978149,
        0.7737645506858826,
        0.7754063606262207,
        0.7742571234703064,
        0.7768839001655579,
        0.7777048349380493,
        0.7768839001655579,
        0.7788540720939636,
        0.7791823744773865,
        0.7781973481178284,
        0.7772122621536255,
        0.7760630249977112,
        0.7781973481178284,
        0.7767197489738464,
        0.7763913869857788,
        0.7762272357940674,
        0.7780331373214722,
        0.7773764729499817,
        0.7755705118179321,
        0.7762272357940674,
        0.7734361886978149,
        0.7754063606262207,
        0.7762272357940674,
        0.7758988738059998,
        0.7768839001655579,
        0.7762272357940674,
        0.7732720375061035,
        0.7706452012062073,
        0.7706452012062073,
        0.7731078863143921,
        0.7713019251823425,
        0.7721228003501892,
        0.7711377739906311,
        0.7704810500144958,
        0.7706452012062073,
        0.7711377739906311,
        0.7701526880264282,
        0.7703168392181396
      ],
      "test_performance": [
        "66.90%",
        "70.76%",
        "71.93%",
        "73.06%",
        "74.16%",
        "74.10%",
        "74.56%",
        "74.59%",
        "74.69%",
        "74.90%",
        "75.33%",
        "75.33%",
        "75.54%",
        "75.97%",
        "75.79%",
        "76.13%",
        "76.06%",
        "76.19%",
        "76.28%",
        "76.16%",
        "76.19%",
        "76.19%",
        "75.91%",
        "75.97%",
        "76.10%",
        "76.10%",
        "76.19%",
        "76.00%",
        "75.97%",
        "75.97%",
        "75.82%",
        "75.85%",
        "75.67%",
        "75.76%",
        "75.85%",
        "75.85%",
        "75.67%",
        "75.61%",
        "75.57%",
        "75.61%",
        "75.73%",
        "75.36%",
        "75.33%",
        "75.24%",
        "75.11%",
        "75.02%",
        "75.21%",
        "75.21%",
        "75.08%",
        "75.24%"
      ]
    }
  },
  "2020-04-13 15:49:26.983976": {
    "file": "app_glove.py",
    "data": {
      "GLOVE_SIZE": 200,
      "TRAIN_PERCENTAGE": 0.8,
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 512,
      "EPOCHS": 50,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13820,
        "output_dim": 200,
        "input_length": 23,
        "embeddings_initializer": "Constant",
        "trainable": false
      },
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": false,
              "batch_input_shape": [
                null,
                23
              ],
              "dtype": "float32",
              "input_dim": 13820,
              "output_dim": 200,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "ndarray"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 23
            }
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "name": "spatial_dropout1d_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.2,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "val_accuracy": [
        0.7435560822486877,
        0.7566902041435242,
        0.7901822328567505,
        0.7860777974128723,
        0.795435905456543,
        0.7967492938041687,
        0.7891971468925476,
        0.7960925698280334,
        0.7990477681159973,
        0.8013462424278259,
        0.7975701689720154,
        0.8011820912361145,
        0.7936299443244934,
        0.7972418069839478,
        0.7885404825210571,
        0.8062715530395508,
        0.8057790398597717,
        0.8029879927635193,
        0.8039730787277222,
        0.7982268929481506,
        0.7988836169242859,
        0.7936299443244934,
        0.7965851426124573,
        0.801838755607605,
        0.8046298027038574,
        0.8028238415718079,
        0.7969135046005249,
        0.8072565793991089,
        0.8064357042312622,
        0.8031522035598755,
        0.8070924282073975,
        0.8059431910514832,
        0.8021671175956726,
        0.806928277015686,
        0.7987194061279297,
        0.8020029664039612,
        0.8057790398597717,
        0.806928277015686,
        0.8062715530395508,
        0.8013462424278259,
        0.8067640662193298,
        0.795928418636322,
        0.8046298027038574,
        0.8024954795837402,
        0.8026596903800964,
        0.7941224575042725,
        0.8031522035598755,
        0.7992119789123535,
        0.8064357042312622,
        0.8057790398597717
      ],
      "test_performance": [
        "73.18%",
        "74.75%",
        "77.75%",
        "77.93%",
        "78.76%",
        "78.70%",
        "78.06%",
        "78.70%",
        "78.61%",
        "79.16%",
        "78.42%",
        "78.88%",
        "78.09%",
        "78.73%",
        "77.51%",
        "79.10%",
        "79.37%",
        "79.01%",
        "78.92%",
        "79.01%",
        "78.95%",
        "78.55%",
        "78.95%",
        "78.85%",
        "78.88%",
        "78.92%",
        "78.64%",
        "78.82%",
        "79.16%",
        "78.92%",
        "79.44%",
        "79.16%",
        "79.01%",
        "78.88%",
        "78.64%",
        "78.82%",
        "79.10%",
        "79.41%",
        "79.44%",
        "78.52%",
        "79.25%",
        "78.46%",
        "79.04%",
        "78.70%",
        "78.70%",
        "77.93%",
        "78.92%",
        "78.79%",
        "79.07%",
        "79.56%"
      ]
    }
  },
  "2020-04-13 15:51:19.130525": {
    "file": "app_glove.py",
    "data": {
      "GLOVE_SIZE": 100,
      "TRAIN_PERCENTAGE": 0.8,
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 512,
      "EPOCHS": 50,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13820,
        "output_dim": 100,
        "input_length": 23,
        "embeddings_initializer": "Constant",
        "trainable": false
      },
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": false,
              "batch_input_shape": [
                null,
                23
              ],
              "dtype": "float32",
              "input_dim": 13820,
              "output_dim": 100,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "ndarray"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 23
            }
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "name": "spatial_dropout1d_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.2,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "val_accuracy": [
        0.7476604580879211,
        0.7632572650909424,
        0.7832868099212646,
        0.7736003994941711,
        0.7868987321853638,
        0.7923165559768677,
        0.7903463840484619,
        0.7951075434684753,
        0.7988836169242859,
        0.7964209318161011,
        0.8000328540802002,
        0.7898538708686829,
        0.7882121205329895,
        0.8023313283920288,
        0.8006895184516907,
        0.8023313283920288,
        0.8044655919075012,
        0.8029879927635193,
        0.8028238415718079,
        0.7995402812957764,
        0.8028238415718079,
        0.7885404825210571,
        0.7951075434684753,
        0.8059431910514832,
        0.8013462424278259,
        0.8092267513275146,
        0.7985552549362183,
        0.7913314700126648,
        0.8008537292480469,
        0.8021671175956726,
        0.8085700273513794,
        0.797898530960083,
        0.8092267513275146,
        0.8023313283920288,
        0.8013462424278259,
        0.7977343797683716,
        0.8100476264953613,
        0.7960925698280334,
        0.8082416653633118,
        0.8105401396751404,
        0.8041372299194336,
        0.8036447167396545,
        0.7964209318161011,
        0.7977343797683716,
        0.797406017780304,
        0.7951075434684753,
        0.8110326528549194,
        0.8061073422431946,
        0.8107042908668518,
        0.8065999150276184
      ],
      "test_performance": [
        "74.07%",
        "75.21%",
        "77.38%",
        "76.31%",
        "77.81%",
        "78.85%",
        "77.81%",
        "78.64%",
        "78.88%",
        "78.21%",
        "79.07%",
        "77.29%",
        "77.38%",
        "78.39%",
        "78.70%",
        "78.33%",
        "78.61%",
        "79.04%",
        "78.98%",
        "78.82%",
        "79.16%",
        "77.69%",
        "78.18%",
        "79.19%",
        "79.13%",
        "79.50%",
        "78.67%",
        "77.72%",
        "78.73%",
        "79.07%",
        "79.10%",
        "78.58%",
        "79.22%",
        "79.10%",
        "78.98%",
        "78.55%",
        "79.50%",
        "78.09%",
        "79.25%",
        "79.41%",
        "78.88%",
        "78.82%",
        "77.72%",
        "78.06%",
        "78.00%",
        "78.24%",
        "79.07%",
        "78.73%",
        "79.47%",
        "79.07%"
      ]
    }
  },
  "2020-04-13 16:01:29.312303": {
    "file": "app_glove.py",
    "data": {
      "GLOVE_SIZE": 100,
      "TRAIN_PERCENTAGE": 0.8,
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 512,
      "EPOCHS": 50,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 1e-05,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13820,
        "output_dim": 100,
        "input_length": 23,
        "embeddings_initializer": "Constant",
        "trainable": false
      },
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": false,
              "batch_input_shape": [
                null,
                23
              ],
              "dtype": "float32",
              "input_dim": 13820,
              "output_dim": 100,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "ndarray"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 23
            }
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "name": "spatial_dropout1d_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.2,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "val_accuracy": [
        0.46806764602661133,
        0.48333606123924255,
        0.4990970194339752,
        0.5096043348312378,
        0.5194549560546875,
        0.5279921293258667,
        0.5332458019256592,
        0.5406337380409241,
        0.5488425493240356,
        0.5519618988037109,
        0.5580364465713501,
        0.560991644859314,
        0.5637826323509216,
        0.5701855421066284,
        0.5721556544303894,
        0.576424241065979,
        0.5844689011573792,
        0.5877524018287659,
        0.5874240398406982,
        0.5905434489250183,
        0.5923493504524231,
        0.5946478247642517,
        0.5966179370880127,
        0.5969462990760803,
        0.5995731353759766,
        0.6008865833282471,
        0.6026924848556519,
        0.6031849980354309,
        0.6040059328079224,
        0.6058118343353271,
        0.6053193211555481,
        0.60679692029953,
        0.608274519443512,
        0.6090953946113586,
        0.610244631767273,
        0.6110655069351196,
        0.6117222309112549,
        0.6120505928993225,
        0.612707257270813,
        0.6123788952827454,
        0.612707257270813,
        0.6130356192588806,
        0.6125431060791016,
        0.6131998300552368,
        0.614677369594574,
        0.6122147440910339,
        0.6120505928993225,
        0.6125431060791016,
        0.6135281324386597,
        0.6138564944267273
      ],
      "test_performance": [
        "47.84%",
        "49.10%",
        "50.69%",
        "52.13%",
        "53.29%",
        "54.52%",
        "55.07%",
        "56.11%",
        "56.85%",
        "57.00%",
        "57.55%",
        "57.98%",
        "58.47%",
        "59.21%",
        "59.55%",
        "59.61%",
        "60.04%",
        "60.25%",
        "60.71%",
        "60.62%",
        "60.74%",
        "60.80%",
        "60.74%",
        "61.08%",
        "61.08%",
        "60.93%",
        "60.83%",
        "60.89%",
        "60.89%",
        "61.05%",
        "61.02%",
        "61.20%",
        "61.11%",
        "61.08%",
        "61.11%",
        "61.11%",
        "61.14%",
        "61.20%",
        "61.20%",
        "61.14%",
        "61.11%",
        "61.17%",
        "61.17%",
        "61.26%",
        "61.42%",
        "61.32%",
        "61.26%",
        "61.35%",
        "61.42%",
        "61.42%"
      ]
    }
  },
  "2020-04-13 16:09:09.569019": {
    "file": "app_glove.py",
    "data": {
      "GLOVE_SIZE": 100,
      "VALIDATION_PERCENTAGE": 0.2,
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 16,
      "EPOCHS": 50,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 1e-05,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13820,
        "output_dim": 100,
        "input_length": 23,
        "embeddings_initializer": "Constant",
        "trainable": false
      },
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": false,
              "batch_input_shape": [
                null,
                23
              ],
              "dtype": "float32",
              "input_dim": 13820,
              "output_dim": 100,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "ndarray"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 23
            }
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "name": "spatial_dropout1d_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.2,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "val_accuracy": [
        0.5889691114425659,
        0.6007879376411438,
        0.6277084946632385,
        0.6552855968475342,
        0.6966513395309448,
        0.7156926989555359,
        0.7360472679138184,
        0.743926465511322,
        0.7472094297409058,
        0.7524622678756714,
        0.7544320225715637,
        0.7570584416389465,
        0.7577150464057922,
        0.7655942440032959,
        0.7675639986991882,
        0.7655942440032959,
        0.7662508487701416,
        0.7688772082328796,
        0.7721602320671082,
        0.7767564058303833,
        0.777413010597229,
        0.7747865915298462,
        0.777413010597229,
        0.7760998010635376,
        0.7787262201309204,
        0.777413010597229,
        0.784635603427887,
        0.7839789986610413,
        0.7806959748268127,
        0.7826657891273499,
        0.7813525795936584,
        0.7826657891273499,
        0.784635603427887,
        0.7879185676574707,
        0.7839789986610413,
        0.7892317771911621,
        0.7879185676574707,
        0.7885751724243164,
        0.7892317771911621,
        0.7898883819580078,
        0.7885751724243164,
        0.7898883819580078,
        0.7898883819580078,
        0.7905449867248535,
        0.7898883819580078,
        0.7912015914916992,
        0.7912015914916992,
        0.7925148010253906,
        0.7898883819580078,
        0.7931713461875916
      ],
      "test_performance": [
        "57.34%",
        "57.98%",
        "60.13%",
        "62.92%",
        "66.38%",
        "70.33%",
        "72.63%",
        "74.07%",
        "74.59%",
        "74.87%",
        "74.99%",
        "75.42%",
        "75.61%",
        "76.06%",
        "76.31%",
        "76.43%",
        "76.71%",
        "76.86%",
        "77.29%",
        "77.29%",
        "77.29%",
        "77.35%",
        "77.41%",
        "77.38%",
        "77.72%",
        "77.75%",
        "77.81%",
        "77.78%",
        "77.87%",
        "77.90%",
        "77.72%",
        "77.93%",
        "77.93%",
        "78.12%",
        "78.24%",
        "78.18%",
        "78.33%",
        "78.30%",
        "78.39%",
        "78.42%",
        "78.27%",
        "78.42%",
        "78.21%",
        "78.33%",
        "78.52%",
        "78.24%",
        "78.39%",
        "78.39%",
        "78.18%",
        "78.24%"
      ]
    }
  },
  "2020-04-13 16:14:18.729783": {
    "file": "app_glove.py",
    "data": {
      "GLOVE_SIZE": 100,
      "VALIDATION_PERCENTAGE": 0.2,
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 16,
      "EPOCHS": 50,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13820,
        "output_dim": 100,
        "input_length": 23,
        "embeddings_initializer": "Constant",
        "trainable": false
      },
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": false,
              "batch_input_shape": [
                null,
                23
              ],
              "dtype": "float32",
              "input_dim": 13820,
              "output_dim": 100,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "ndarray"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 23
            }
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "name": "spatial_dropout1d_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.2,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "val_accuracy": [
        0.8082731366157532,
        0.8076165318489075,
        0.818122148513794,
        0.8273144960403442,
        0.8076165318489075,
        0.8279711008071899,
        0.8351936936378479,
        0.8286277055740356,
        0.8378201127052307,
        0.8365069031715393,
        0.8338804841041565,
        0.8378201127052307,
        0.8240315318107605,
        0.8424162864685059,
        0.8312541246414185,
        0.847012460231781,
        0.8319107294082642,
        0.8266578912734985,
        0.8430728912353516,
        0.8332238793373108,
        0.8391332626342773,
        0.8273144960403442,
        0.8450427055358887,
        0.8378201127052307,
        0.8220617175102234,
        0.8312541246414185,
        0.8332238793373108,
        0.8279711008071899,
        0.8384767174720764,
        0.8319107294082642,
        0.8128693103790283,
        0.8214051127433777,
        0.837163507938385,
        0.8194352984428406,
        0.8200919032096863,
        0.8325672745704651,
        0.8273144960403442,
        0.8240315318107605,
        0.8319107294082642,
        0.8273144960403442,
        0.8148391246795654,
        0.8227183222770691,
        0.820748507976532,
        0.8168089389801025,
        0.8332238793373108,
        0.813525915145874,
        0.8168089389801025,
        0.8260012865066528,
        0.8279711008071899,
        0.8279711008071899
      ],
      "test_performance": [
        "78.92%",
        "79.19%",
        "79.44%",
        "79.47%",
        "77.93%",
        "80.14%",
        "80.39%",
        "80.08%",
        "80.63%",
        "80.63%",
        "80.17%",
        "80.29%",
        "79.87%",
        "80.57%",
        "80.39%",
        "80.75%",
        "80.75%",
        "80.48%",
        "81.03%",
        "80.97%",
        "81.12%",
        "80.17%",
        "81.12%",
        "80.72%",
        "79.71%",
        "80.94%",
        "80.57%",
        "80.48%",
        "80.88%",
        "81.15%",
        "79.74%",
        "80.26%",
        "81.03%",
        "80.05%",
        "80.08%",
        "80.63%",
        "80.57%",
        "80.42%",
        "80.45%",
        "80.23%",
        "79.80%",
        "80.54%",
        "80.14%",
        "80.48%",
        "80.75%",
        "80.08%",
        "80.32%",
        "80.42%",
        "80.02%",
        "80.66%"
      ]
    }
  },
  "2020-04-13 16:17:35.438170": {
    "file": "app_glove.py",
    "data": {
      "GLOVE_SIZE": 25,
      "VALIDATION_PERCENTAGE": 0.2,
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 16,
      "EPOCHS": 50,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13820,
        "output_dim": 25,
        "input_length": 23,
        "embeddings_initializer": "Constant",
        "trainable": false
      },
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": false,
              "batch_input_shape": [
                null,
                23
              ],
              "dtype": "float32",
              "input_dim": 13820,
              "output_dim": 25,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "ndarray"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 23
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "val_accuracy": [
        0.564674973487854,
        0.6447800397872925,
        0.6848325729370117,
        0.7156926989555359,
        0.7261983156204224,
        0.7399868965148926,
        0.7413000464439392,
        0.7557452321052551,
        0.760998010635376,
        0.7662508487701416,
        0.7695338129997253,
        0.7715036273002625,
        0.7734733819961548,
        0.7728168368339539,
        0.7741299867630005,
        0.7754431962966919,
        0.7747865915298462,
        0.7754431962966919,
        0.7741299867630005,
        0.7767564058303833,
        0.7787262201309204,
        0.7787262201309204,
        0.7780696153640747,
        0.7787262201309204,
        0.777413010597229,
        0.780039370059967,
        0.7826657891273499,
        0.7787262201309204,
        0.780039370059967,
        0.777413010597229,
        0.7806959748268127,
        0.7787262201309204,
        0.7806959748268127,
        0.7813525795936584,
        0.7806959748268127,
        0.7806959748268127,
        0.7806959748268127,
