{"2020-04-09 14:01:07.112808": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 4], "dtype": "float32", "input_dim": 118, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 4}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5702099800109863, 0.5702099800109863, 0.5702099800109863, 0.5702099800109863, 0.5702099800109863, 0.5702099800109863, 0.5702099800109863, 0.5702099800109863, 0.5682414770126343, 0.5682414770126343, 0.5682414770126343, 0.5682414770126343, 0.5682414770126343, 0.567585289478302, 0.567585289478302, 0.567585289478302, 0.5662729740142822, 0.5662729740142822, 0.5662729740142822, 0.5662729740142822, 0.5662729740142822, 0.5662729740142822, 0.5662729740142822, 0.5662729740142822, 0.56561678647995, 0.56561678647995, 0.56561678647995, 0.56561678647995, 0.56561678647995, 0.56561678647995], "constants": {"BATCH_SIZE": 512, "EPOCHS": 30, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 118, "output_dim": 16, "input_length": 4}}}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": true, "REVERSE_SORT": true, "TWEETS_FOR_VOCABULARY_BASE": false, "ADD_START_SYMBOL": true}}, "2020-04-09 14:01:41.567427": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 4], "dtype": "float32", "input_dim": 118, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 4}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5702099800109863, 0.5702099800109863, 0.5702099800109863, 0.569553792476654, 0.569553792476654, 0.5708661675453186, 0.5715222954750061, 0.5734907984733582, 0.5734907984733582, 0.5734907984733582, 0.5734907984733582, 0.5741469860076904, 0.5741469860076904, 0.5734907984733582, 0.5741469860076904, 0.5741469860076904, 0.5741469860076904, 0.5741469860076904, 0.5741469860076904, 0.5741469860076904, 0.5741469860076904, 0.5741469860076904, 0.5741469860076904, 0.5741469860076904, 0.5741469860076904, 0.5741469860076904, 0.5741469860076904, 0.5741469860076904, 0.5741469860076904, 0.5741469860076904], "constants": {"BATCH_SIZE": 512, "EPOCHS": 30, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 118, "output_dim": 16, "input_length": 4}}}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": true, "REVERSE_SORT": true, "TWEETS_FOR_VOCABULARY_BASE": false, "ADD_START_SYMBOL": true}}, "2020-04-09 14:25:22.791521": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 30, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 15396, "output_dim": 32, "input_length": 27}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 27], "dtype": "float32", "input_dim": 15396, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 27}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5780839920043945, 0.5938320159912109, 0.6450130939483643, 0.7073490619659424, 0.7414698004722595, 0.7460629940032959, 0.7604987025260925, 0.7650918364524841, 0.7736220359802246, 0.7814960479736328, 0.7854330539703369, 0.787401556968689, 0.7913385629653931, 0.7939632534980774, 0.7972440719604492, 0.7933070659637451, 0.7952755689620972, 0.7972440719604492, 0.7972440719604492, 0.7933070659637451, 0.7946194410324097, 0.7965879440307617, 0.7919947504997253, 0.7906824350357056, 0.7913385629653931, 0.7906824350357056, 0.7887139320373535, 0.787401556968689, 0.7913385629653931, 0.7887139320373535]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": true, "TWEETS_FOR_VOCABULARY_BASE": null, "ADD_START_SYMBOL": true}}, "2020-04-09 14:27:28.022624": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 30, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 8526, "output_dim": 512, "input_length": 27}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 27], "dtype": "float32", "input_dim": 8526, "output_dim": 512, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 27}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.7440944910049438, 0.7979002594947815, 0.819553792476654, 0.8307086825370789, 0.8254593014717102, 0.8267716765403748, 0.8300524950027466, 0.8208661675453186, 0.8221784830093384, 0.8228346705436707, 0.8221784830093384, 0.8143044710159302, 0.8136482834815979, 0.8116797804832458, 0.8103674650192261, 0.8090550899505615, 0.8024934530258179, 0.808398962020874, 0.8070865869522095, 0.7985564470291138, 0.7992125749588013, 0.8005249500274658, 0.7985564470291138, 0.7952755689620972, 0.7992125749588013, 0.7952755689620972, 0.7952755689620972, 0.7952755689620972, 0.7939632534980774, 0.7959317564964294]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": true, "TWEETS_FOR_VOCABULARY_BASE": true, "ADD_START_SYMBOL": true}}, "2020-04-09 14:54:15.513294": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 5, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 15396, "output_dim": 512, "input_length": 27}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 27], "dtype": "float32", "input_dim": 15396, "output_dim": 512, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 27}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.6981627345085144, 0.7644357085227966, 0.7887139320373535, 0.7998687624931335, 0.7972440719604492]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": true, "TWEETS_FOR_VOCABULARY_BASE": null, "ADD_START_SYMBOL": true}}, "2020-04-09 15:02:18.227106": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 5, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 8051, "output_dim": 512, "input_length": 21}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 21], "dtype": "float32", "input_dim": 8051, "output_dim": 512, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 21}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.7559055089950562, 0.8070865869522095, 0.834645688533783, 0.8372703194618225, 0.8326771855354309], "test_performance": ["67.48%", "72.54%", "75.88%", "76.65%", "77.63%"]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": true, "TWEETS_FOR_VOCABULARY_BASE": true, "ADD_START_SYMBOL": true}}, "2020-04-09 15:03:13.462863": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 15, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 8051, "output_dim": 512, "input_length": 21}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 21], "dtype": "float32", "input_dim": 8051, "output_dim": 512, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 21}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.7559055089950562, 0.7919947504997253, 0.8261154890060425, 0.8300524950027466, 0.8228346705436707, 0.8215222954750061, 0.8116797804832458, 0.8116797804832458, 0.8051180839538574, 0.8070865869522095, 0.8057742714881897, 0.8044619560241699, 0.8044619560241699, 0.8018372654914856, 0.7985564470291138], "test_performance": ["68.22%", "71.96%", "75.91%", "77.02%", "78.03%", "78.33%", "78.52%", "78.15%", "78.21%", "78.36%", "78.46%", "77.87%", "77.81%", "78.21%", "77.84%"]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": true, "TWEETS_FOR_VOCABULARY_BASE": true, "ADD_START_SYMBOL": true}}, "2020-04-09 15:04:23.568644": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 15, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 8050, "output_dim": 512, "input_length": 21}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 21], "dtype": "float32", "input_dim": 8050, "output_dim": 512, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 21}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.7559055089950562, 0.7788714170455933, 0.7933070659637451, 0.8031495809555054, 0.8011810779571533, 0.7992125749588013, 0.7926509380340576, 0.7946194410324097, 0.7880577445030212, 0.7867454290390015, 0.7860892415046692, 0.7814960479736328, 0.7775590419769287, 0.7716535329818726, 0.7775590419769287], "test_performance": ["68.83%", "72.94%", "75.08%", "77.23%", "77.54%", "77.78%", "77.87%", "77.93%", "77.81%", "77.90%", "77.81%", "77.84%", "77.75%", "77.66%", "77.29%"]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": true, "REVERSE_SORT": false, "TWEETS_FOR_VOCABULARY_BASE": true, "ADD_START_SYMBOL": false}}, "2020-04-09 15:05:32.658453": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 15, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10855, "output_dim": 512, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10855, "output_dim": 512, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.7191600799560547, 0.7683727145195007, 0.7992125749588013, 0.7998687624931335, 0.8070865869522095, 0.8011810779571533, 0.7985564470291138, 0.7979002594947815, 0.8005249500274658, 0.7926509380340576, 0.7841207385063171, 0.7906824350357056, 0.7834645509719849, 0.7821522355079651, 0.7795275449752808], "test_performance": ["70.30%", "76.71%", "77.81%", "78.09%", "79.10%", "78.88%", "79.07%", "78.76%", "78.55%", "78.03%", "77.54%", "77.72%", "77.11%", "76.98%", "76.52%"]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": false, "TWEETS_FOR_VOCABULARY_BASE": null, "ADD_START_SYMBOL": false}}, "2020-04-09 15:06:35.633392": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 15, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10855, "output_dim": 16, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10855, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5702099800109863, 0.5853018164634705, 0.6115485429763794, 0.6404199600219727, 0.6732283234596252, 0.7014435529708862, 0.7145669460296631, 0.7250655889511108, 0.7342519760131836, 0.748031497001648, 0.7637795209884644, 0.7677165269851685, 0.7723097205162048, 0.7762467265129089, 0.7795275449752808], "test_performance": ["57.09%", "58.54%", "61.14%", "63.53%", "66.07%", "69.72%", "71.65%", "73.34%", "74.35%", "74.87%", "75.88%", "76.13%", "76.49%", "76.77%", "76.89%"]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": false, "TWEETS_FOR_VOCABULARY_BASE": null, "ADD_START_SYMBOL": false}}, "2020-04-09 15:08:09.601555": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 50, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10855, "output_dim": 16, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10855, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5708661675453186, 0.5741469860076904, 0.5813648104667664, 0.5997375249862671, 0.6384514570236206, 0.6765092015266418, 0.7060367465019226, 0.7276902794837952, 0.73884516954422, 0.751968502998352, 0.7598425149917603, 0.7703412175178528, 0.7755905389785767, 0.7828084230422974, 0.7913385629653931, 0.7939632534980774, 0.7972440719604492, 0.7952755689620972, 0.7939632534980774, 0.7979002594947815, 0.7985564470291138, 0.7998687624931335, 0.8011810779571533, 0.8018372654914856, 0.8011810779571533, 0.8038057684898376, 0.8044619560241699, 0.8031495809555054, 0.8024934530258179, 0.7992125749588013, 0.8038057684898376, 0.8018372654914856, 0.8051180839538574, 0.8018372654914856, 0.8018372654914856, 0.8018372654914856, 0.8005249500274658, 0.8024934530258179, 0.8031495809555054, 0.8024934530258179, 0.8011810779571533, 0.7979002594947815, 0.7979002594947815, 0.7979002594947815, 0.7979002594947815, 0.7965879440307617, 0.7972440719604492, 0.7959317564964294, 0.7959317564964294, 0.7952755689620972], "test_performance": ["57.37%", "57.77%", "58.69%", "61.17%", "64.39%", "67.48%", "69.72%", "71.10%", "72.17%", "73.74%", "74.16%", "75.18%", "75.57%", "76.03%", "76.19%", "76.46%", "76.95%", "77.38%", "77.51%", "77.69%", "77.47%", "77.60%", "77.51%", "77.81%", "78.03%", "78.12%", "78.18%", "78.24%", "78.49%", "78.61%", "78.73%", "78.82%", "78.79%", "78.76%", "78.79%", "78.82%", "78.64%", "78.58%", "78.64%", "78.64%", "78.39%", "78.76%", "78.67%", "78.64%", "78.55%", "78.46%", "78.36%", "78.39%", "78.36%", "78.36%"]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": false, "TWEETS_FOR_VOCABULARY_BASE": null, "ADD_START_SYMBOL": false}}, "2020-04-09 15:12:23.457737": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 50, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10855, "output_dim": 16, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10855, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5721784830093384, 0.5787401795387268, 0.6023622155189514, 0.6272965669631958, 0.663385808467865, 0.7086614370346069, 0.7283464670181274, 0.751968502998352, 0.7532808184623718, 0.7631233334541321, 0.7690288424491882, 0.7762467265129089, 0.7841207385063171, 0.7834645509719849, 0.7860892415046692, 0.7919947504997253, 0.7972440719604492, 0.7979002594947815, 0.8051180839538574, 0.8031495809555054, 0.8038057684898376, 0.8031495809555054, 0.8070865869522095, 0.8024934530258179, 0.8044619560241699, 0.8038057684898376, 0.8051180839538574, 0.8051180839538574, 0.8057742714881897, 0.8038057684898376, 0.8031495809555054, 0.7992125749588013, 0.7998687624931335, 0.7972440719604492, 0.7992125749588013, 0.7959317564964294, 0.7965879440307617, 0.7952755689620972, 0.7939632534980774, 0.7913385629653931, 0.7906824350357056, 0.789370059967041, 0.7887139320373535, 0.789370059967041, 0.789370059967041, 0.7880577445030212, 0.7880577445030212, 0.7860892415046692, 0.7854330539703369, 0.7854330539703369], "test_performance": ["57.34%", "57.68%", "59.33%", "61.60%", "65.49%", "68.86%", "71.01%", "73.40%", "73.92%", "75.11%", "75.51%", "76.06%", "76.34%", "76.59%", "76.74%", "76.92%", "77.32%", "77.47%", "77.41%", "77.72%", "78.00%", "78.21%", "78.33%", "78.49%", "78.30%", "78.64%", "78.06%", "78.61%", "78.58%", "78.39%", "78.46%", "78.42%", "78.42%", "78.42%", "78.92%", "78.46%", "78.82%", "78.73%", "78.64%", "78.58%", "78.46%", "78.52%", "78.46%", "78.33%", "78.36%", "78.12%", "78.00%", "78.00%", "78.06%", "78.00%"]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": false, "TWEETS_FOR_VOCABULARY_BASE": null, "ADD_START_SYMBOL": false}}, "2020-04-09 15:29:12.983572": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 50, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10855, "output_dim": 16, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10855, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5741469860076904, 0.5761154890060425, 0.5964567065238953, 0.6220472455024719, 0.6673228144645691, 0.6961942315101624, 0.7244094610214233, 0.7362204790115356, 0.748031497001648, 0.76115483045578, 0.7709974050521851, 0.7769029140472412, 0.7834645509719849, 0.7880577445030212, 0.7919947504997253, 0.7939632534980774, 0.7933070659637451, 0.7998687624931335, 0.8018372654914856, 0.8018372654914856, 0.8044619560241699, 0.8024934530258179, 0.8044619560241699, 0.8031495809555054, 0.8051180839538574, 0.8051180839538574, 0.8044619560241699, 0.8044619560241699, 0.8024934530258179, 0.808398962020874, 0.8038057684898376, 0.8024934530258179, 0.8031495809555054, 0.8024934530258179, 0.8038057684898376, 0.8031495809555054, 0.8024934530258179, 0.8051180839538574, 0.8044619560241699, 0.8038057684898376, 0.8011810779571533, 0.7998687624931335, 0.7985564470291138, 0.7979002594947815, 0.7972440719604492, 0.7965879440307617, 0.7965879440307617, 0.7952755689620972, 0.7959317564964294, 0.7906824350357056], "test_performance": ["57.71%", "57.80%", "59.30%", "61.91%", "65.65%", "69.48%", "71.87%", "72.72%", "73.95%", "74.96%", "75.85%", "76.00%", "76.56%", "76.68%", "77.11%", "77.29%", "77.44%", "77.97%", "78.42%", "78.46%", "78.55%", "78.55%", "78.67%", "78.61%", "78.73%", "78.82%", "78.82%", "78.61%", "78.85%", "78.73%", "78.73%", "78.67%", "78.73%", "78.55%", "78.49%", "78.73%", "78.67%", "78.64%", "78.58%", "78.52%", "78.42%", "78.39%", "78.33%", "78.03%", "77.93%", "78.00%", "77.78%", "77.84%", "77.78%", "77.66%"]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": false, "TWEETS_FOR_VOCABULARY_BASE": null, "ADD_START_SYMBOL": false}}, "2020-04-09 15:29:39.675965": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 50, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10855, "output_dim": 16, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10855, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5793963074684143, 0.5787401795387268, 0.5938320159912109, 0.6207349300384521, 0.6443569660186768, 0.6863517165184021, 0.710629940032959, 0.7211285829544067, 0.7381889820098877, 0.7493438124656677, 0.7624672055244446, 0.7657480239868164, 0.7664042115211487, 0.7762467265129089, 0.7847769260406494, 0.7814960479736328, 0.7867454290390015, 0.787401556968689, 0.7906824350357056, 0.7900262475013733, 0.789370059967041, 0.7913385629653931, 0.7946194410324097, 0.7946194410324097, 0.7919947504997253, 0.7952755689620972, 0.7926509380340576, 0.7919947504997253, 0.7913385629653931, 0.7933070659637451, 0.7913385629653931, 0.789370059967041, 0.7900262475013733, 0.7887139320373535, 0.789370059967041, 0.7887139320373535, 0.789370059967041, 0.789370059967041, 0.7887139320373535, 0.789370059967041, 0.7867454290390015, 0.7867454290390015, 0.7860892415046692, 0.7847769260406494, 0.7841207385063171, 0.7821522355079651, 0.7821522355079651, 0.7834645509719849, 0.780183732509613, 0.7821522355079651], "test_performance": ["57.95%", "58.01%", "59.55%", "61.75%", "63.84%", "67.39%", "69.45%", "70.70%", "72.85%", "73.77%", "74.56%", "74.87%", "75.18%", "76.10%", "76.22%", "76.46%", "76.62%", "76.80%", "76.98%", "77.02%", "77.05%", "77.51%", "77.51%", "77.57%", "77.93%", "77.93%", "77.97%", "78.00%", "78.00%", "77.97%", "78.03%", "77.75%", "77.90%", "78.12%", "78.09%", "77.90%", "77.84%", "77.81%", "77.78%", "77.84%", "77.75%", "77.72%", "77.72%", "77.44%", "77.51%", "77.47%", "77.17%", "77.05%", "77.14%", "77.05%"]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": false, "TWEETS_FOR_VOCABULARY_BASE": null, "ADD_START_SYMBOL": false}}, "2020-04-09 15:30:51.508293": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 50, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10855, "output_dim": 16, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10855, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5741469860076904, 0.5820209980010986, 0.5885826945304871, 0.6181102395057678, 0.6686351895332336, 0.7014435529708862, 0.7178477644920349, 0.7349081635475159, 0.7434383034706116, 0.7559055089950562, 0.7650918364524841, 0.7690288424491882, 0.7723097205162048, 0.7749344110488892, 0.780183732509613, 0.7814960479736328, 0.7828084230422974, 0.7880577445030212, 0.7906824350357056, 0.7913385629653931, 0.7900262475013733, 0.7933070659637451, 0.7900262475013733, 0.7900262475013733, 0.7906824350357056, 0.7913385629653931, 0.7933070659637451, 0.7939632534980774, 0.7939632534980774, 0.7939632534980774, 0.7946194410324097, 0.7946194410324097, 0.7959317564964294, 0.7939632534980774, 0.7926509380340576, 0.7919947504997253, 0.7913385629653931, 0.7913385629653931, 0.7906824350357056, 0.7900262475013733, 0.7880577445030212, 0.7887139320373535, 0.7880577445030212, 0.7900262475013733, 0.7880577445030212, 0.7854330539703369, 0.7854330539703369, 0.7841207385063171, 0.778215229511261, 0.7788714170455933], "test_performance": ["57.34%", "58.11%", "59.27%", "61.63%", "65.09%", "68.16%", "70.27%", "72.54%", "73.74%", "74.35%", "75.42%", "76.06%", "76.74%", "77.11%", "77.17%", "77.44%", "77.63%", "78.03%", "78.03%", "78.39%", "78.58%", "78.61%", "78.85%", "78.98%", "78.76%", "78.82%", "79.04%", "79.07%", "78.88%", "79.01%", "79.10%", "79.10%", "79.01%", "79.01%", "79.13%", "79.19%", "78.98%", "79.13%", "78.98%", "78.92%", "78.88%", "79.13%", "79.04%", "79.10%", "79.04%", "79.07%", "79.04%", "79.01%", "78.82%", "78.85%"]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": false, "TWEETS_FOR_VOCABULARY_BASE": null, "ADD_START_SYMBOL": false}}, "2020-04-09 15:32:10.290003": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 50, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10855, "output_dim": 16, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10855, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5708661675453186, 0.5774278044700623, 0.5931758284568787, 0.6437007784843445, 0.6640419960021973, 0.6981627345085144, 0.7230970859527588, 0.7395012974739075, 0.7486876845359802, 0.759186327457428, 0.7637795209884644, 0.7709974050521851, 0.7808399200439453, 0.7808399200439453, 0.7847769260406494, 0.7913385629653931, 0.7959317564964294, 0.7972440719604492, 0.7972440719604492, 0.7985564470291138, 0.8011810779571533, 0.8031495809555054, 0.8018372654914856, 0.7998687624931335, 0.8031495809555054, 0.8018372654914856, 0.8031495809555054, 0.8051180839538574, 0.8038057684898376, 0.8038057684898376, 0.8038057684898376, 0.8044619560241699, 0.8018372654914856, 0.8024934530258179, 0.8038057684898376, 0.8044619560241699, 0.8011810779571533, 0.7998687624931335, 0.7965879440307617, 0.7992125749588013, 0.7972440719604492, 0.7972440719604492, 0.7959317564964294, 0.7913385629653931, 0.7913385629653931, 0.7946194410324097, 0.789370059967041, 0.7887139320373535, 0.7887139320373535, 0.787401556968689], "test_performance": ["57.09%", "57.83%", "59.33%", "63.01%", "65.49%", "69.02%", "70.30%", "71.71%", "73.03%", "74.90%", "75.45%", "75.67%", "76.71%", "77.26%", "77.41%", "77.72%", "77.81%", "78.06%", "78.42%", "78.46%", "78.85%", "78.98%", "78.92%", "78.95%", "78.85%", "78.79%", "78.88%", "79.16%", "79.01%", "79.10%", "79.16%", "78.95%", "78.85%", "78.88%", "78.79%", "78.61%", "78.70%", "78.58%", "78.55%", "78.52%", "78.52%", "78.52%", "78.52%", "78.58%", "78.64%", "78.49%", "78.55%", "78.46%", "78.46%", "78.39%"]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": false, "TWEETS_FOR_VOCABULARY_BASE": null, "ADD_START_SYMBOL": false}}, "2020-04-09 15:32:51.837491": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 50, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10855, "output_dim": 16, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10855, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5708661675453186, 0.5748031735420227, 0.5971128344535828, 0.6568241715431213, 0.6863517165184021, 0.7178477644920349, 0.7335957884788513, 0.76115483045578, 0.7703412175178528, 0.7775590419769287, 0.7795275449752808, 0.7860892415046692, 0.7880577445030212, 0.7913385629653931, 0.7906824350357056, 0.7946194410324097, 0.7919947504997253, 0.7919947504997253, 0.7952755689620972, 0.7985564470291138, 0.7979002594947815, 0.7972440719604492, 0.7979002594947815, 0.7965879440307617, 0.7992125749588013, 0.7959317564964294, 0.7972440719604492, 0.7933070659637451, 0.7946194410324097, 0.7939632534980774, 0.7906824350357056, 0.7926509380340576, 0.7926509380340576, 0.7933070659637451, 0.7939632534980774, 0.7906824350357056, 0.7906824350357056, 0.7906824350357056, 0.7880577445030212, 0.7913385629653931, 0.7854330539703369, 0.7834645509719849, 0.7808399200439453, 0.7814960479736328, 0.7814960479736328, 0.780183732509613, 0.7808399200439453, 0.780183732509613, 0.780183732509613, 0.7808399200439453], "test_performance": ["57.09%", "57.59%", "59.39%", "63.71%", "67.64%", "70.49%", "72.26%", "73.86%", "74.20%", "75.33%", "75.67%", "76.16%", "76.86%", "76.89%", "77.26%", "77.35%", "77.78%", "78.03%", "78.15%", "78.61%", "78.64%", "78.76%", "78.88%", "78.98%", "78.95%", "79.01%", "79.22%", "79.22%", "79.19%", "79.16%", "79.25%", "79.10%", "79.19%", "79.28%", "79.10%", "78.82%", "78.82%", "78.95%", "78.85%", "78.98%", "78.67%", "78.55%", "78.52%", "78.76%", "78.64%", "78.70%", "78.70%", "78.64%", "78.58%", "78.39%"]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": false, "TWEETS_FOR_VOCABULARY_BASE": null, "ADD_START_SYMBOL": false}}, "2020-04-09 15:35:42.638142": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 50, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10855, "output_dim": 16, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10855, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5708661675453186, 0.5761154890060425, 0.6010498404502869, 0.6207349300384521, 0.6640419960021973, 0.6975065469741821, 0.7204724550247192, 0.7427821755409241, 0.7526246905326843, 0.7637795209884644, 0.7664042115211487, 0.7729659080505371, 0.778215229511261, 0.7821522355079651, 0.787401556968689, 0.7939632534980774, 0.7959317564964294, 0.7979002594947815, 0.7992125749588013, 0.7965879440307617, 0.7972440719604492, 0.8011810779571533, 0.8011810779571533, 0.8005249500274658, 0.7979002594947815, 0.7965879440307617, 0.7952755689620972, 0.7965879440307617, 0.7959317564964294, 0.7965879440307617, 0.7959317564964294, 0.7979002594947815, 0.7959317564964294, 0.7946194410324097, 0.7919947504997253, 0.7913385629653931, 0.7919947504997253, 0.7933070659637451, 0.7926509380340576, 0.7926509380340576, 0.7933070659637451, 0.7939632534980774, 0.7919947504997253, 0.7926509380340576, 0.7906824350357056, 0.7926509380340576, 0.7913385629653931, 0.7906824350357056, 0.7900262475013733, 0.789370059967041], "test_performance": ["57.13%", "57.43%", "59.76%", "61.45%", "65.31%", "69.20%", "70.76%", "72.14%", "73.52%", "74.32%", "75.24%", "75.64%", "76.13%", "76.59%", "76.65%", "77.14%", "77.41%", "77.69%", "77.72%", "77.90%", "78.03%", "78.33%", "78.42%", "78.70%", "78.98%", "78.82%", "78.82%", "78.64%", "78.82%", "78.92%", "78.95%", "78.82%", "78.95%", "78.92%", "79.01%", "78.92%", "78.79%", "78.85%", "78.73%", "78.58%", "78.61%", "78.39%", "78.36%", "78.36%", "78.42%", "78.24%", "78.27%", "78.24%", "78.12%", "78.18%"]}, "vocabulary": {"WORDS_REPUTATION_FILTER": 0, "SORT_VOCABULARY": false, "REVERSE_SORT": false, "TWEETS_FOR_VOCABULARY_BASE": null, "ADD_START_SYMBOL": 