{
  "2020-04-29 09:19:11.007824": {
    "file": "app_bert.py",
    "model": {
      "BERT": "bert_en_uncased_L-12_H-768_A-12",
      "BATCH_SIZE": 16,
      "EPOCHS": 4,
      "VERBOSE": 1,
      "OPTIMIZER": "adam",
      "LEARNING_RATE": 2e-06,
      "SHUFFLE": true,
      "VALIDATION_PERCENTAGE": 0.2,
      "config": {
        "name": "model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                84
              ],
              "dtype": "int32",
              "sparse": false,
              "ragged": false,
              "name": "input_word_ids"
            },
            "name": "input_word_ids",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                84
              ],
              "dtype": "int32",
              "sparse": false,
              "ragged": false,
              "name": "input_mask"
            },
            "name": "input_mask",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                84
              ],
              "dtype": "int32",
              "sparse": false,
              "ragged": false,
              "name": "segment_ids"
            },
            "name": "segment_ids",
            "inbound_nodes": []
          },
          {
            "class_name": "KerasLayer",
            "config": {
              "name": "keras_layer",
              "trainable": true,
              "dtype": "float32",
              "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_L-12_H-768_A-12/2"
            },
            "name": "keras_layer",
            "inbound_nodes": [
              [
                [
                  "input_word_ids",
                  0,
                  0,
                  {}
                ],
                [
                  "input_mask",
                  0,
                  0,
                  {}
                ],
                [
                  "segment_ids",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TensorFlowOpLayer",
            "config": {
              "name": "strided_slice",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "strided_slice",
                "op": "StridedSlice",
                "input": [
                  "keras_layer/Identity_1",
                  "strided_slice/begin",
                  "strided_slice/end",
                  "strided_slice/strides"
                ],
                "attr": {
                  "shrink_axis_mask": {
                    "i": "2"
                  },
                  "begin_mask": {
                    "i": "5"
                  },
                  "ellipsis_mask": {
                    "i": "0"
                  },
                  "new_axis_mask": {
                    "i": "0"
                  },
                  "end_mask": {
                    "i": "5"
                  },
                  "Index": {
                    "type": "DT_INT32"
                  },
                  "T": {
                    "type": "DT_FLOAT"
                  }
                }
              },
              "constants": {
                "1": "{\"class_name\": \"ndarray\"}",
                "2": "{\"class_name\": \"ndarray\"}",
                "3": "{\"class_name\": \"ndarray\"}"
              }
            },
            "name": "tf_op_layer_strided_slice",
            "inbound_nodes": [
              [
                [
                  "keras_layer",
                  0,
                  1,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
              [
                [
                  "tf_op_layer_strided_slice",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input_word_ids",
            0,
            0
          ],
          [
            "input_mask",
            0,
            0
          ],
          [
            "segment_ids",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "dense",
            0,
            0
          ]
        ]
      },
      "history": {
        "loss": [
          0.57098,
          0.41403,
          0.36659,
          0.33466
        ],
        "accuracy": [
          0.70312,
          0.81806,
          0.84992,
          0.86108
        ],
        "val_loss": [
          0.44885,
          0.4112,
          0.40945,
          0.40375
        ],
        "val_accuracy": [
          0.80827,
          0.82534,
          0.83913,
          0.83585
        ],
        "test_loss": [
          0.46077,
          0.42709,
          0.42273,
          0.41808
        ],
        "test_accuracy": [
          0.79497,
          0.8103,
          0.81551,
          0.82869
        ]
      }
    }
  },
  "2020-04-29 09:39:10.166307": {
    "file": "app_sklearn.py",
    "data": {
      "VALIDATION_PERCENTAGE": 0.2,
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": false,
        "unslang": true,
        "split_words": false,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": false,
        "join": true
      }
    },
    "classifier": {
      "classifier": {
        "TYPE": "SVM",
        "OPTIONS": {}
      },
      "val_score": 0.79645,
      "test_score": 0.7916
    },
    "vectorizer": {
      "TYPE": "TFIDF",
      "OPTIONS": {
        "binary": true
      }
    }
  },
  "2020-04-29 10:00:05.767035": {
    "file": "app_sklearn.py",
    "data": {
      "VALIDATION_PERCENTAGE": 0.2,
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": false,
        "unslang": true,
        "split_words": false,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": false,
        "join": true
      }
    },
    "classifier": {
      "classifier": {
        "TYPE": "SVM",
        "OPTIONS": {}
      },
      "val_score": 0.80696,
      "test_score": 0.79099
    },
    "vectorizer": {
      "TYPE": "TFIDF",
      "OPTIONS": {
        "binary": true
      }
    }
  },
  "2020-04-29 10:18:54.444714": {
    "file": "app_sklearn.py",
    "data": {
      "VALIDATION_PERCENTAGE": 0.2,
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": false,
        "unslang": true,
        "split_words": false,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": false,
        "join": true
      }
    },
    "classifier": {
      "classifier": {
        "TYPE": "SVM",
        "OPTIONS": {}
      },
      "val_score": 0.80827,
      "test_score": 0.79497
    },
    "vectorizer": {
      "TYPE": "TFIDF",
      "OPTIONS": {
        "binary": true
      }
    }
  },
  "2020-04-29 10:20:57.725105": {
    "file": "app_sklearn.py",
    "data": {
      "VALIDATION_PERCENTAGE": 0.2,
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": false,
        "unslang": true,
        "split_words": false,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": false,
        "join": true
      }
    },
    "classifier": {
      "classifier": {
        "TYPE": "SGDClassifier",
        "OPTIONS": {}
      },
      "val_score": 0.8109,
      "test_score": 0.78363
    },
    "vectorizer": {
      "TYPE": "TFIDF",
      "OPTIONS": {
        "binary": true
      }
    }
  },
  "2020-04-29 10:21:37.067788": {
    "file": "app_sklearn.py",
    "data": {
      "VALIDATION_PERCENTAGE": 0.2,
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": false,
        "unslang": true,
        "split_words": false,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": false,
        "join": true
      }
    },
    "classifier": {
      "classifier": {
        "TYPE": "SGDClassifier",
        "OPTIONS": {}
      },
      "val_score": 0.79645,
      "test_score": 0.78333
    },
    "vectorizer": {
      "TYPE": "TFIDF",
      "OPTIONS": {
        "binary": true
      }
    }
  },
  "2020-04-29 11:26:32.668930": {
    "file": "app_keras.py",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": true,
        "add_location_flag": true,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 32,
      "EPOCHS": 20,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13822,
        "output_dim": 128,
        "input_length": 25
      },
      "VALIDATION_PERCENTAGE": 0.2,
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                25
              ],
              "dtype": "float32",
              "input_dim": 13822,
              "output_dim": 128,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 25
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.67218,
          0.65579,
          0.63988,
          0.62186,
          0.60239,
          0.57992,
          0.55534,
          0.52916,
          0.50237,
          0.47556,
          0.44971,
          0.42513,
          0.4021,
          0.38098,
          0.36169,
          0.34387,
          0.32769,
          0.31313,
          0.29964,
          0.28738
        ],
        "accuracy": [
          0.58358,
          0.58686,
          0.62069,
          0.68407,
          0.75796,
          0.7931,
          0.81757,
          0.83284,
          0.84368,
          0.85156,
          0.85813,
          0.86617,
          0.86995,
          0.87668,
          0.88292,
          0.88604,
          0.89146,
          0.89409,
          0.89836,
          0.90296
        ],
        "val_loss": [
          0.67858,
          0.66799,
          0.65662,
          0.6441,
          0.63458,
          0.62407,
          0.61269,
          0.59855,
          0.5848,
          0.57087,
          0.55767,
          0.5455,
          0.53544,
          0.52325,
          0.51472,
          0.50649,
          0.50079,
          0.49364,
          0.48873,
          0.48477
        ],
        "val_accuracy": [
          0.53578,
          0.53841,
          0.5719,
          0.64609,
          0.66907,
          0.69599,
          0.72292,
          0.73605,
          0.74721,
          0.75115,
          0.76034,
          0.76494,
          0.77479,
          0.77676,
          0.78267,
          0.78529,
          0.78792,
          0.7912,
          0.78923,
          0.79448
        ],
        "test_loss": [
          0.66802,
          0.65688,
          0.64517,
          0.63237,
          0.62061,
          0.60756,
          0.59342,
          0.5771,
          0.56116,
          0.54546,
          0.53093,
          0.51826,
          0.50828,
          0.49639,
          0.48916,
          0.4821,
          0.47932,
          0.47289,
          0.4704,
          0.46821
        ],
        "test_accuracy": [
          0.57033,
          0.5783,
          0.61508,
          0.68832,
          0.7061,
          0.71683,
          0.73092,
          0.74962,
          0.75575,
          0.75881,
          0.76678,
          0.77199,
          0.77751,
          0.77934,
          0.78241,
          0.78486,
          0.78517,
          0.79222,
          0.79314,
          0.79375
        ]
      }
    }
  },
  "2020-04-29 11:27:30.720964": {
    "file": "app_keras.py",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": true,
        "add_location_flag": true,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 32,
      "EPOCHS": 30,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13822,
        "output_dim": 128,
        "input_length": 25
      },
      "VALIDATION_PERCENTAGE": 0.2,
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                25
              ],
              "dtype": "float32",
              "input_dim": 13822,
              "output_dim": 128,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 25
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.67272,
          0.65418,
          0.63832,
          0.62069,
          0.60088,
          0.57843,
          0.554,
          0.52803,
          0.50151,
          0.47504,
          0.44938,
          0.42483,
          0.40211,
          0.38059,
          0.36134,
          0.34347,
          0.32707,
          0.31244,
          0.29898,
          0.2865,
          0.27492,
          0.2642,
          0.2543,
          0.24511,
          0.23601,
          0.22787,
          0.21993,
          0.21253,
          0.20541,
          0.19845
        ],
        "accuracy": [
          0.58276,
          0.59064,
          0.62348,
          0.71511,
          0.75583,
          0.79606,
          0.81609,
          0.83399,
          0.84631,
          0.85287,
          0.85764,
          0.86338,
          0.87159,
          0.87619,
          0.87898,
          0.88604,
          0.89179,
          0.89475,
          0.90066,
          0.90361,
          0.90657,
          0.91248,
          0.91544,
          0.91856,
          0.92365,
          0.92627,
          0.93136,
          0.93251,
          0.93629,
          0.93777
        ],
        "val_loss": [
          0.67522,
          0.66474,
          0.65271,
          0.64323,
          0.63118,
          0.61987,
          0.6068,
          0.59334,
          0.58032,
          0.56747,
          0.55448,
          0.541,
          0.53,
          0.52112,
          0.51134,
          0.50334,
          0.49714,
          0.4913,
          0.4866,
          0.48274,
          0.47942,
          0.47675,
          0.47453,
          0.4738,
          0.47319,
          0.47296,
          0.47142,
          0.47413,
          0.47338,
          0.47533
        ],
        "val_accuracy": [
          0.53578,
          0.54235,
          0.60013,
          0.64347,
          0.69665,
          0.72095,
          0.73802,
          0.74393,
          0.74721,
          0.75443,
          0.75968,
          0.76362,
          0.76822,
          0.77676,
          0.78004,
          0.78267,
          0.78858,
          0.78661,
          0.78858,
          0.78661,
          0.78595,
          0.7912,
          0.79383,
          0.79383,
          0.79383,
          0.79383,
          0.7958,
          0.78792,
          0.78923,
          0.78464
        ],
        "test_loss": [
          0.66561,
          0.65456,
          0.64257,
          0.63166,
          0.61816,
          0.60471,
          0.58946,
          0.57362,
          0.55826,
          0.54376,
          0.52968,
          0.51514,
          0.50414,
          0.49643,
          0.48686,
          0.47976,
          0.4762,
          0.47047,
          0.46929,
          0.46675,
          0.46571,
          0.46532,
          0.46594,
          0.46564,
          0.46674,
          0.46786,
          0.4701,
          0.47105,
          0.47353,
          0.4755
        ],
        "test_accuracy": [
          0.57064,
          0.58229,
          0.63255,
          0.66748,
          0.70641,
          0.72234,
          0.73828,
          0.7441,
          0.75176,
          0.7585,
          0.76433,
          0.76954,
          0.77475,
          0.77475,
          0.7818,
          0.78639,
          0.78762,
          0.79191,
          0.79314,
          0.79222,
          0.79099,
          0.7913,
          0.7913,
          0.78854,
          0.78823,
          0.78793,
          0.78854,
          0.78884,
          0.78854,
          0.78762
        ]
      }
    }
  },
  "2020-04-29 11:29:33.439485": {
    "file": "app_keras.py",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": false,
        "unslang": true,
        "split_words": false,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": false,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 32,
      "EPOCHS": 30,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 15574,
        "output_dim": 128,
        "input_length": 26
      },
      "VALIDATION_PERCENTAGE": 0.2,
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                26
              ],
              "dtype": "float32",
              "input_dim": 15574,
              "output_dim": 128,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 26
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.67515,
          0.66282,
          0.65014,
          0.63512,
          0.61671,
          0.59527,
          0.57103,
          0.54449,
          0.51655,
          0.48797,
          0.45994,
          0.43246,
          0.40744,
          0.38382,
          0.3623,
          0.343,
          0.32575,
          0.31009,
          0.29596,
          0.28322,
          0.27124,
          0.26055,
          0.25024,
          0.24072,
          0.23184,
          0.22337,
          0.21514,
          0.20761,
          0.20035,
          0.19336
        ],
        "accuracy": [
          0.5803,
          0.58358,
          0.59803,
          0.62726,
          0.68095,
          0.75074,
          0.7821,
          0.81232,
          0.83498,
          0.84943,
          0.85911,
          0.87307,
          0.87586,
          0.88374,
          0.88539,
          0.89245,
          0.89606,
          0.89885,
          0.90263,
          0.90673,
          0.90887,
          0.91412,
          0.91741,
          0.92184,
          0.92397,
          0.92693,
          0.93071,
          0.93366,
          0.93547,
          0.93859
        ],
        "val_loss": [
          0.68745,
          0.67815,
          0.67213,
          0.66223,
          0.6509,
          0.64242,
          0.62949,
          0.618,
          0.60491,
          0.59201,
          0.5786,
          0.56976,
          0.55452,
          0.54364,
          0.53373,
          0.52562,
          0.51937,
          0.51387,
          0.50938,
          0.50589,
          0.50384,
          0.50166,
          0.49999,
          0.49867,
          0.49805,
          0.49826,
          0.49802,
          0.49941,
          0.50023,
          0.49985
        ],
        "val_accuracy": [
          0.53578,
          0.53644,
          0.5371,
          0.56467,
          0.62837,
          0.64084,
          0.68418,
          0.70125,
          0.71832,
          0.72817,
          0.73473,
          0.7367,
          0.7459,
          0.75115,
          0.75575,
          0.7564,
          0.7564,
          0.7564,
          0.75837,
          0.76165,
          0.76888,
          0.77347,
          0.77413,
          0.77479,
          0.77216,
          0.77282,
          0.77544,
          0.77347,
          0.77019,
          0.77019
        ],
        "test_loss": [
          0.67472,
          0.66577,
          0.65806,
          0.64678,
          0.63339,
          0.6219,
          0.60574,
          0.59089,
          0.57467,
          0.55888,
          0.54296,
          0.53472,
          0.51682,
          0.50564,
          0.49495,
          0.48742,
          0.48318,
          0.4791,
          0.47671,
          0.47522,
          0.47222,
          0.4724,
          0.47249,
          0.47392,
          0.4751,
          0.47586,
          0.47804,
          0.47937,
          0.48149,
          0.48437
        ],
        "test_accuracy": [
          0.57033,
          0.57064,
          0.5829,
          0.60834,
          0.65614,
          0.67269,
          0.70395,
          0.71836,
          0.72755,
          0.74012,
          0.75207,
          0.7487,
          0.76034,
          0.76617,
          0.7723,
          0.77444,
          0.77659,
          0.77965,
          0.77965,
          0.78118,
          0.78302,
          0.78455,
          0.78547,
          0.78517,
          0.78517,
          0.78394,
          0.78455,
          0.78517,
          0.78486,
          0.78394
        ]
      }
    }
  },
  "2020-04-29 11:33:44.326087": {
    "file": "app_keras.py",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": false,
        "unslang": true,
        "split_words": false,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": false,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 16,
      "EPOCHS": 10,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 15574,
        "output_dim": 128,
        "input_length": 26
      },
      "VALIDATION_PERCENTAGE": 0.2,
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                26
              ],
              "dtype": "float32",
              "input_dim": 15574,
              "output_dim": 128,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 26
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 128,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.2,
              "implementation": 1
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.67918,
          0.63323,
          0.48809,
          0.4371,
          0.40573,
          0.38863,
          0.37204,
          0.35953,
          0.34259,
          0.34193
        ],
        "accuracy": [
          0.58342,
          0.63875,
          0.77767,
          0.81084,
          0.82906,
          0.83842,
          0.85025,
          0.85649,
          0.86141,
          0.86617
        ],
        "val_loss": [
          0.68944,
          0.57399,
          0.53538,
          0.5075,
          0.49119,
          0.51578,
          0.47923,
          0.50267,
          0.48318,
          0.47531
        ],
        "val_accuracy": [
          0.53644,
          0.70978,
          0.74261,
          0.74918,
          0.75181,
          0.74655,
          0.761,
          0.74984,
          0.7715,
          0.77282
        ],
        "test_loss": [
          0.67915,
          0.54486,
          0.51493,
          0.4824,
          0.48109,
          0.48729,
          0.47283,
          0.48025,
          0.50049,
          0.49256
        ],
        "test_accuracy": [
          0.57033,
          0.74502,
          0.76647,
          0.77352,
          0.78057,
          0.77965,
          0.78517,
          0.78118,
          0.78302,
          0.78149
        ]
      }
    }
  },
  "2020-04-29 11:39:03.095607": {
    "file": "app_keras.py",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": false,
        "unslang": true,
        "split_words": false,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": false,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 16,
      "EPOCHS": 10,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 15574,
        "output_dim": 64,
        "input_length": 26
      },
      "VALIDATION_PERCENTAGE": 0.2,
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                26
              ],
              "dtype": "float32",
              "input_dim": 15574,
              "output_dim": 64,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 26
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.2,
              "implementation": 1
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.57083,
          0.40279,
          0.35306,
          0.32132,
          0.30323,
          0.28747,
          0.27218,
          0.25173,
          0.24262,
          0.22739
        ],
        "accuracy": [
          0.70969,
          0.84089,
          0.8619,
          0.88112,
          0.88719,
          0.90066,
          0.90378,
          0.91067,
          0.91773,
          0.92677
        ],
        "val_loss": [
          0.48977,
          0.50127,
          0.47163,
          0.45649,
          0.49829,
          0.48764,
          0.51601,
          0.61567,
          0.54389,
          0.56288
        ],
        "val_accuracy": [
          0.76428,
          0.77347,
          0.78398,
          0.79645,
          0.78989,
          0.78398,
          0.78726,
          0.75968,
          0.74721,
          0.74393
        ],
        "test_loss": [
          0.47706,
          0.51698,
          0.51122,
          0.48792,
          0.5509,
          0.50482,
          0.57256,
          0.57555,
          0.52644,
          0.52709
        ],
        "test_accuracy": [
          0.78118,
          0.78241,
          0.78302,
          0.79068,
          0.78884,
          0.78915,
          0.7867,
          0.78026,
          0.77597,
          0.77812
        ]
      }
    }
  },
  "2020-04-29 11:41:54.798480": {
    "file": "app_keras.py",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": false,
        "unslang": true,
        "split_words": false,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": false,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 32,
      "EPOCHS": 10,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 15574,
        "output_dim": 128,
        "input_length": 26
      },
      "VALIDATION_PERCENTAGE": 0.2,
      "TYPE": "BIDIRECTIONAL_LSTM",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                26
              ],
              "dtype": "float32",
              "input_dim": 15574,
              "output_dim": 128,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 26
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_2",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": false,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 64,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                      "gain": 1.0,
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.56055,
          0.36269,
          0.30413,
          0.26593,
          0.23262,
          0.20262,
          0.17572,
          0.15537,
          0.1362,
          0.12381
        ],
        "accuracy": [
          0.72151,
          0.85419,
          0.87849,
          0.89819,
          0.91806,
          0.92972,
          0.93859,
          0.94877,
          0.95632,
          0.96076
        ],
        "val_loss": [
          0.47833,
          0.46559,
          0.46925,
          0.51214,
          0.51296,
          0.61016,
          0.61247,
          0.63993,
          0.7658,
          0.68853
        ],
        "val_accuracy": [
          0.79383,
          0.78661,
          0.78726,
          0.76953,
          0.78201,
          0.71963,
          0.75049,
          0.73539,
          0.7065,
          0.73145
        ],
        "test_loss": [
          0.46772,
          0.46325,
          0.48424,
          0.50351,
          0.55544,
          0.57185,
          0.62796,
          0.63357,
          0.68967,
          0.67025
        ],
        "test_accuracy": [
          0.78762,
          0.79099,
          0.7916,
          0.78455,
          0.78425,
          0.77015,
          0.77597,
          0.76433,
          0.74839,
          0.76647
        ]
      }
    }
  },
  "2020-04-29 11:42:41.748936": {
    "file": "app_keras.py",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": false,
        "unslang": true,
        "split_words": false,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": false,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 32,
      "EPOCHS": 10,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 15574,
        "output_dim": 32,
        "input_length": 26
      },
      "VALIDATION_PERCENTAGE": 0.2,
      "TYPE": "BIDIRECTIONAL_LSTM",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                26
              ],
              "dtype": "float32",
              "input_dim": 15574,
              "output_dim": 32,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 26
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_2",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": false,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 64,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
