{
  "2020-04-07 19:58:02.893176": {
    "data": {
      "preprocess_options": {
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": true,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      },
      "words_reputation_filter": 2,
      "add_start_symbol": true,
      "train_percentage": 0.8,
      "vocabulary_len": 2857
    },
    "model": {
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                19
              ],
              "dtype": "float32",
              "input_dim": 2857,
              "output_dim": 64,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 19
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "val_accuracy": [
          0.5357846617698669,
          0.5397242307662964,
          0.6428102254867554,
          0.7406434416770935,
          0.7524622678756714,
          0.7688772082328796,
          0.7813525795936584,
          0.7879185676574707,
          0.7957977652549744,
          0.7997373342514038,
          0.8003939390182495,
          0.8010505437850952,
          0.8017071485519409,
          0.8017071485519409,
          0.7990807890892029,
          0.7990807890892029,
          0.7971109747886658,
          0.7971109747886658,
          0.7977675795555115,
          0.7984241843223572,
          0.7957977652549744,
          0.7951411604881287,
          0.7925148010253906,
          0.7931713461875916,
          0.7905449867248535,
          0.7879185676574707,
          0.7866053581237793,
          0.7879185676574707,
          0.7859488129615784,
          0.7839789986610413
        ]
      },
      "epochs": 30,
      "embedding_dim": 64,
      "input_len": 19,
      "batch_size": 512,
      "optimizer": "adam"
    }
  },
  "2020-04-07 19:59:51.105303": {
    "data": {
      "preprocess_options": {
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": true,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      },
      "words_reputation_filter": 0,
      "add_start_symbol": true,
      "train_percentage": 0.8,
      "vocabulary_len": 6172
    },
    "model": {
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                20
              ],
              "dtype": "float32",
              "input_dim": 6172,
              "output_dim": 64,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 20
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "val_accuracy": [
          0.5344714522361755,
          0.5377544164657593,
          0.6434668302536011,
          0.7301378846168518,
          0.7491792440414429,
          0.7675639986991882,
          0.7741299867630005,
          0.7859488129615784,
          0.7971109747886658,
          0.794484555721283,
          0.8010505437850952,
          0.7964543700218201,
          0.7957977652549744,
          0.7984241843223572,
          0.7997373342514038,
          0.8017071485519409,
          0.8017071485519409,
          0.7984241843223572,
          0.7984241843223572,
          0.7957977652549744,
          0.7971109747886658,
          0.7931713461875916,
          0.7918581962585449,
          0.7925148010253906,
          0.7931713461875916,
          0.7918581962585449,
          0.7892317771911621,
          0.7885751724243164,
          0.7866053581237793,
          0.7879185676574707
        ]
      },
      "epochs": 30,
      "embedding_dim": 64,
      "input_len": 20,
      "batch_size": 512,
      "optimizer": "adam"
    }
  },
  "2020-04-07 20:00:21.721728": {
    "data": {
      "preprocess_options": {
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": false,
        "join": false
      },
      "words_reputation_filter": 2,
      "add_start_symbol": true,
      "train_percentage": 0.8,
      "vocabulary_len": 3332
    },
    "model": {
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                20
              ],
              "dtype": "float32",
              "input_dim": 3332,
              "output_dim": 64,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 20
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "val_accuracy": [
          0.5357846617698669,
          0.5515429973602295,
          0.6986211538314819,
          0.7518056631088257,
          0.7662508487701416,
          0.7741299867630005,
          0.7839789986610413,
          0.7892317771911621,
          0.7971109747886658,
          0.8017071485519409,
          0.803676962852478,
          0.803676962852478,
          0.8010505437850952,
          0.7997373342514038,
          0.7971109747886658,
          0.7957977652549744,
          0.7957977652549744,
          0.7957977652549744,
          0.794484555721283,
          0.794484555721283,
          0.7912015914916992,
          0.7925148010253906,
          0.7918581962585449,
          0.7912015914916992,
          0.7905449867248535,
          0.7885751724243164,
          0.7905449867248535,
          0.7885751724243164,
          0.787261962890625,
          0.7892317771911621
        ]
      },
      "epochs": 30,
      "embedding_dim": 64,
      "input_len": 20,
      "batch_size": 512,
      "optimizer": "adam"
    }
  },
  "2020-04-07 20:00:59.489520": {
    "data": {
      "preprocess_options": {
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": false,
        "join": false
      },
      "words_reputation_filter": 2,
      "add_start_symbol": true,
      "train_percentage": 0.8,
      "vocabulary_len": 3332
    },
    "model": {
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                20
              ],
              "dtype": "float32",
              "input_dim": 3332,
              "output_dim": 128,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 20
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "val_accuracy": [
          0.5344714522361755,
          0.6428102254867554,
          0.7518056631088257,
          0.7649376392364502,
          0.7813525795936584,
          0.7898883819580078,
          0.7977675795555115,
          0.7997373342514038,
          0.8010505437850952,
          0.7977675795555115,
          0.7984241843223572,
          0.7977675795555115,
          0.7951411604881287,
          0.7905449867248535,
          0.7905449867248535,
          0.7892317771911621,
          0.7905449867248535,
          0.7918581962585449,
          0.7918581962585449,
          0.7905449867248535,
          0.7905449867248535,
          0.7905449867248535,
          0.7905449867248535,
          0.7879185676574707,
          0.787261962890625,
          0.784635603427887,
          0.7813525795936584,
          0.777413010597229,
          0.777413010597229,
          0.7747865915298462
        ]
      },
      "epochs": 30,
      "embedding_dim": 128,
      "input_len": 20,
      "batch_size": 512,
      "optimizer": "adam"
    }
  },
  "2020-04-07 20:02:38.745313": {
    "data": {
      "preprocess_options": {
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": false,
        "join": false
      },
      "words_reputation_filter": 2,
      "add_start_symbol": true,
      "train_percentage": 0.8,
      "vocabulary_len": 3332
    },
    "model": {
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                20
              ],
              "dtype": "float32",
              "input_dim": 3332,
              "output_dim": 32,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 20
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "val_accuracy": [
          0.5364412069320679,
          0.5364412069320679,
          0.5508863925933838,
          0.6552855968475342,
          0.7242285013198853,
          0.7426132559776306,
          0.7642810344696045,
          0.7708470225334167,
          0.7793828248977661,
          0.7839789986610413,
          0.7898883819580078,
          0.7957977652549744,
          0.8017071485519409,
          0.8017071485519409,
          0.8010505437850952,
          0.8049901723861694,
          0.8049901723861694,
          0.8030203580856323,
          0.8017071485519409,
          0.8043335676193237,
          0.8017071485519409,
          0.7984241843223572,
          0.7957977652549744,
          0.7951411604881287,
          0.7951411604881287,
          0.7964543700218201,
          0.7938279509544373,
          0.7957977652549744,
          0.7977675795555115,
          0.7977675795555115
        ]
      },
      "epochs": 30,
      "embedding_dim": 32,
      "input_len": 20,
      "batch_size": 512,
      "optimizer": "adam"
    }
  },
  "2020-04-07 20:03:12.113428": {
    "data": {
      "preprocess_options": {
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": true,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      },
      "words_reputation_filter": 2,
      "add_start_symbol": true,
      "train_percentage": 0.8,
      "vocabulary_len": 2857
    },
    "model": {
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                19
              ],
              "dtype": "float32",
              "input_dim": 2857,
              "output_dim": 32,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 19
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "val_accuracy": [
          0.5364412069320679,
          0.5686146020889282,
          0.6375574469566345,
          0.6808930039405823,
          0.7373604774475098,
          0.743926465511322,
          0.7557452321052551,
          0.7708470225334167,
          0.7760998010635376,
          0.7866053581237793,
          0.7925148010253906,
          0.7931713461875916,
          0.7951411604881287,
          0.7977675795555115,
          0.7997373342514038,
          0.8003939390182495,
          0.8030203580856323,
          0.8049901723861694,
          0.8076165318489075,
          0.8095863461494446,
          0.8082731366157532,
          0.8102429509162903,
          0.8082731366157532,
          0.8122127652168274,
          0.810899555683136,
          0.8102429509162903,
          0.8095863461494446,
          0.8082731366157532,
          0.8076165318489075,
          0.8056467771530151
        ]
      },
      "epochs": 30,
      "embedding_dim": 32,
      "input_len": 19,
      "batch_size": 512,
      "optimizer": "rmsprop"
    }
  },
  "2020-04-07 20:04:06.089005": {
    "data": {
      "preprocess_options": {
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": true,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      },
      "words_reputation_filter": 2,
      "add_start_symbol": true,
      "train_percentage": 0.8,
      "vocabulary_len": 5019
    },
    "model": {
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                20
              ],
              "dtype": "float32",
              "input_dim": 5019,
              "output_dim": 32,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 20
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 256,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "val_accuracy": [
          0.7143794894218445,
          0.7734733819961548,
          0.7734733819961548,
          0.760998010635376,
          0.7268549203872681,
          0.7590282559394836,
          0.7590282559394836,
          0.7603414058685303,
          0.760998010635376,
          0.7557452321052551,
          0.7281680703163147,
          0.7426132559776306,
          0.7432698607444763,
          0.7353906631469727,
          0.7360472679138184,
          0.7445830702781677,
          0.7386736869812012,
          0.7301378846168518,
          0.7373604774475098,
          0.7380170822143555,
          0.7137229442596436,
          0.727511465549469,
          0.7143794894218445,
          0.7216020822525024,
          0.7373604774475098,
          0.7189757227897644,
          0.7307944893836975,
          0.7288246750831604,
          0.7353906631469727,
          0.7340774536132812
        ]
      },
      "epochs": 30,
      "embedding_dim": 32,
      "input_len": 20,
      "batch_size": 512,
      "optimizer": "rmsprop"
    }
  },
  "2020-04-07 20:04:50.749567": {
    "data": {
      "preprocess_options": {
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": true,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      },
      "words_reputation_filter": 0,
      "add_start_symbol": true,
      "train_percentage": 0.8,
      "vocabulary_len": 10866
    },
    "model": {
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                21
              ],
              "dtype": "float32",
              "input_dim": 10866,
              "output_dim": 32,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 21
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "val_accuracy": [
          0.7682206034660339,
          0.7951411604881287,
          0.7577150464057922,
          0.7642810344696045,
          0.780039370059967,
          0.7741299867630005,
          0.7682206034660339,
          0.7577150464057922,
          0.7603414058685303,
          0.7294812798500061,
          0.7189757227897644,
          0.7445830702781677,
          0.7281680703163147,
          0.7288246750831604,
          0.7137229442596436,
          0.6979645490646362,
          0.7051871418952942,
          0.7051871418952942,
          0.7045305371284485,
          0.7078135013580322,
          0.6940249800682068,
          0.6992777585983276,
          0.6894287467002869,
          0.6979645490646362,
          0.6946815252304077,
          0.70124751329422,
          0.6966513395309448,
          0.6848325729370117,
          0.6874589920043945,
          0.6900853514671326
        ]
      },
      "epochs": 30,
      "embedding_dim": 32,
      "input_len": 21,
      "batch_size": 512,
      "optimizer": "rmsprop"
    }
  },
  "2020-04-07 20:05:29.426667": {
    "data": {
      "preprocess_options": {
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": true,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      },
      "words_reputation_filter": 0,
      "add_start_symbol": true,
      "train_percentage": 0.8,
      "vocabulary_len": 10866
    },
    "model": {
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                21
              ],
              "dtype": "float32",
              "input_dim": 10866,
              "output_dim": 64,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 21
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "val_accuracy": [
          0.6907419562339783,
          0.7905449867248535,
          0.794484555721283,
          0.780039370059967,
          0.7629678249359131,
          0.7590282559394836,
          0.7636244297027588,
          0.7728168368339539,
          0.7590282559394836,
          0.7570584416389465
        ]
      },
      "epochs": 10,
      "embedding_dim": 64,
      "input_len": 21,
      "batch_size": 512,
      "optimizer": "rmsprop"
    }
  },
  "2020-04-07 20:06:26.761399": {
    "data": {
      "preprocess_options": {
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": true,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      },
      "words_reputation_filter": 0,
      "add_start_symbol": true,
      "train_percentage": 0.8,
      "vocabulary_len": 10866
    },
    "model": {
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                21
              ],
              "dtype": "float32",
              "input_dim": 10866,
              "output_dim": 256,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 21
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "units": 256,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "val_accuracy": [
          0.7708470225334167,
          0.7925148010253906,
          0.7885751724243164,
          0.7787262201309204,
          0.7754431962966919,
          0.7294812798500061,
          0.743926465511322,
          0.7327643036842346,
          0.7353906631469727,
          0.7386736869812012
        ]
      },
      "epochs": 10,
      "embedding_dim": 256,
      "input_len": 21,
      "batch_size": 512,
      "optimizer": "rmsprop"
    }
  },
  "2020-04-07 20:07:01.245989": {
    "data": {
      "preprocess_options": {
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": true,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      },
      "words_reputation_filter": 0,
      "add_start_symbol": true,
      "train_percentage": 0.8,
      "vocabulary_len": 10866
    },
    "model": {
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                21
              ],
              "dtype": "float32",
              "input_dim": 10866,
              "output_dim": 32,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 21
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_1",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_1",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": false,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "units": 32,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                      "scale": 1.0,
                      "mode": "fan_avg",
                      "distribution": "uniform",
                      "seed": null
                    }
                  },
                  "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                      "gain": 1.0,
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 24,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "val_accuracy": [
          0.5364412069320679,
          0.7524622678756714,
          0.7820091843605042,
          0.7826657891273499,
          0.8003939390182495,
          0.6782665848731995,
          0.7879185676574707,
          0.7852922081947327,
          0.7938279509544373,
          0.7826657891273499
        ]
      },
      "epochs": 10,
      "embedding_dim": 32,
      "input_len": 21,
      "batch_size": 512,
      "optimizer": "rmsprop"
    }
  },
  "2020-04-07 20:07:26.985201": {
    "data": {
      "preprocess_options": {
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": true,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      },
      "words_reputation_filter": 0,
      "add_start_symbol": true,
      "train_percentage": 0.8,
      "vocabulary_len": 10866
    },
    "model": {
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                21
              ],
              "dtype": "float32",
              "input_dim": 10866,
              "output_dim": 32,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 21
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_1",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_1",
                  "trainable": true,
                  "dtype": "float32",
