{"2020-04-11 16:01:49.994837": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 30, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 9557, "output_dim": 16, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 9557, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.6089239120483398, 0.5885826945304871, 0.6095800399780273, 0.6410760879516602, 0.6686351895332336, 0.7066929340362549, 0.7230970859527588, 0.7250655889511108, 0.7375327944755554, 0.7486876845359802, 0.76115483045578, 0.7631233334541321, 0.7716535329818726, 0.7808399200439453, 0.7814960479736328, 0.7834645509719849, 0.787401556968689, 0.7913385629653931, 0.7952755689620972, 0.7959317564964294, 0.7965879440307617, 0.7979002594947815, 0.7998687624931335, 0.8005249500274658, 0.8011810779571533, 0.7998687624931335, 0.7998687624931335, 0.8005249500274658, 0.8031495809555054, 0.8038057684898376], "test_performance": ["59.76%", "58.32%", "60.07%", "62.46%", "65.74%", "69.14%", "72.51%", "72.23%", "74.07%", "74.93%", "76.10%", "76.43%", "76.65%", "76.80%", "77.02%", "77.32%", "77.44%", "77.47%", "77.66%", "77.72%", "77.93%", "78.12%", "78.06%", "78.39%", "78.49%", "78.49%", "78.67%", "78.67%", "78.67%", "78.76%"]}}, "2020-04-11 16:02:17.909843": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 50, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 9592, "output_dim": 16, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 9592, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5748031735420227, 0.5767716765403748, 0.5951443314552307, 0.6213910579681396, 0.6456692814826965, 0.6745406985282898, 0.7007874250411987, 0.7171915769577026, 0.7276902794837952, 0.7460629940032959, 0.7532808184623718, 0.76115483045578, 0.7618110179901123, 0.7631233334541321, 0.7677165269851685, 0.7729659080505371, 0.7755905389785767, 0.778215229511261, 0.7828084230422974, 0.7841207385063171, 0.7828084230422974, 0.7867454290390015, 0.789370059967041, 0.7887139320373535, 0.7933070659637451, 0.7939632534980774, 0.7939632534980774, 0.7952755689620972, 0.7933070659637451, 0.7933070659637451, 0.7946194410324097, 0.7946194410324097, 0.7919947504997253, 0.7913385629653931, 0.7919947504997253, 0.7919947504997253, 0.7913385629653931, 0.7900262475013733, 0.787401556968689, 0.787401556968689, 0.7867454290390015, 0.7867454290390015, 0.7854330539703369, 0.7814960479736328, 0.780183732509613, 0.7795275449752808, 0.7762467265129089, 0.7762467265129089, 0.7755905389785767, 0.7736220359802246], "test_performance": ["57.80%", "57.92%", "59.39%", "62.12%", "65.12%", "67.73%", "70.00%", "71.53%", "73.12%", "74.56%", "75.48%", "76.13%", "76.43%", "76.86%", "77.02%", "77.35%", "77.60%", "78.12%", "78.42%", "78.52%", "78.42%", "78.58%", "78.52%", "78.49%", "78.67%", "78.70%", "78.73%", "78.67%", "78.79%", "78.88%", "78.73%", "78.92%", "79.01%", "79.16%", "79.31%", "79.50%", "79.62%", "79.68%", "79.59%", "79.59%", "79.47%", "79.34%", "79.13%", "79.07%", "78.88%", "78.67%", "78.79%", "78.73%", "78.67%", "78.58%"]}}, "2020-04-11 16:04:33.976423": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 50, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 13476, "output_dim": 16, "input_length": 27}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 27], "dtype": "float32", "input_dim": 13476, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 27}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5708661675453186, 0.5807086825370789, 0.5990813374519348, 0.624015748500824, 0.6548556685447693, 0.6699475049972534, 0.6830708384513855, 0.7060367465019226, 0.7112860679626465, 0.7237532734870911, 0.7368766665458679, 0.7434383034706116, 0.751968502998352, 0.7572178244590759, 0.7604987025260925, 0.7631233334541321, 0.7650918364524841, 0.7644357085227966, 0.7637795209884644, 0.7690288424491882, 0.7703412175178528, 0.7709974050521851, 0.7755905389785767, 0.7742782235145569, 0.7755905389785767, 0.7736220359802246, 0.7762467265129089, 0.7769029140472412, 0.7749344110488892, 0.7762467265129089, 0.7755905389785767, 0.7769029140472412, 0.780183732509613, 0.7762467265129089, 0.778215229511261, 0.778215229511261, 0.7762467265129089, 0.7769029140472412, 0.7742782235145569, 0.7729659080505371, 0.7749344110488892, 0.7749344110488892, 0.7742782235145569, 0.7736220359802246, 0.7723097205162048, 0.7729659080505371, 0.7723097205162048, 0.7736220359802246, 0.7723097205162048, 0.7703412175178528], "test_performance": ["57.13%", "58.01%", "59.73%", "62.24%", "65.58%", "66.41%", "68.00%", "70.03%", "70.40%", "71.22%", "72.76%", "73.61%", "73.98%", "74.07%", "74.41%", "74.96%", "75.15%", "75.57%", "75.85%", "76.03%", "76.22%", "76.37%", "76.46%", "77.02%", "77.08%", "76.92%", "77.11%", "77.02%", "77.26%", "77.26%", "77.29%", "77.23%", "77.23%", "77.20%", "77.14%", "77.26%", "77.41%", "77.29%", "77.29%", "77.35%", "77.29%", "77.32%", "77.17%", "77.26%", "77.05%", "77.14%", "76.89%", "76.92%", "76.83%", "76.98%"]}}, "2020-04-11 16:05:21.595127": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 50, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 12793, "output_dim": 16, "input_length": 21}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 21], "dtype": "float32", "input_dim": 12793, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 21}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5905511975288391, 0.5905511975288391, 0.6076115369796753, 0.6312335729598999, 0.6502624750137329, 0.6660104990005493, 0.6975065469741821, 0.7119422554969788, 0.7257217764854431, 0.7290025949478149, 0.748031497001648, 0.7493438124656677, 0.7578740119934082, 0.76115483045578, 0.759186327457428, 0.7624672055244446, 0.7677165269851685, 0.7709974050521851, 0.7749344110488892, 0.7808399200439453, 0.7854330539703369, 0.7808399200439453, 0.7821522355079651, 0.7834645509719849, 0.7847769260406494, 0.7860892415046692, 0.7847769260406494, 0.7847769260406494, 0.7854330539703369, 0.7860892415046692, 0.7841207385063171, 0.7847769260406494, 0.7828084230422974, 0.7854330539703369, 0.7841207385063171, 0.7834645509719849, 0.7841207385063171, 0.7834645509719849, 0.7828084230422974, 0.7821522355079651, 0.7808399200439453, 0.7808399200439453, 0.7808399200439453, 0.778215229511261, 0.7788714170455933, 0.778215229511261, 0.778215229511261, 0.7762467265129089, 0.7775590419769287, 0.7769029140472412], "test_performance": ["58.66%", "58.93%", "60.68%", "63.32%", "64.76%", "66.50%", "70.18%", "71.59%", "72.33%", "72.60%", "73.49%", "73.86%", "74.38%", "74.93%", "75.67%", "76.06%", "76.46%", "76.74%", "76.74%", "76.86%", "77.02%", "77.35%", "77.41%", "77.63%", "77.54%", "77.63%", "77.72%", "77.51%", "77.54%", "77.60%", "77.57%", "77.87%", "77.75%", "77.63%", "77.60%", "77.60%", "77.72%", "77.66%", "77.57%", "77.41%", "77.44%", "77.41%", "77.14%", "76.86%", "77.02%", "76.98%", "76.95%", "76.80%", "76.80%", "76.83%"]}}, "2020-04-11 16:06:22.368388": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 30, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 12802, "output_dim": 128, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 12802, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5984252095222473, 0.7211285829544067, 0.7276902794837952, 0.76115483045578, 0.780183732509613, 0.7854330539703369, 0.7919947504997253, 0.7939632534980774, 0.7926509380340576, 0.7992125749588013, 0.7952755689620972, 0.7985564470291138, 0.7965879440307617, 0.8018372654914856, 0.7933070659637451, 0.7913385629653931, 0.789370059967041, 0.787401556968689, 0.7828084230422974, 0.780183732509613, 0.778215229511261, 0.778215229511261, 0.7795275449752808, 0.7762467265129089, 0.7775590419769287, 0.7618110179901123, 0.7618110179901123, 0.7683727145195007, 0.7670603394508362, 0.7578740119934082], "test_performance": ["60.01%", "71.07%", "72.60%", "75.05%", "76.22%", "76.98%", "77.57%", "78.18%", "78.42%", "78.64%", "78.64%", "78.88%", "78.85%", "78.36%", "78.30%", "78.46%", "78.00%", "78.00%", "77.84%", "77.81%", "77.75%", "77.57%", "77.57%", "77.08%", "77.08%", "76.77%", "76.92%", "76.77%", "76.68%", "76.68%"]}}, "2020-04-11 16:07:49.078361": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 30, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10323, "output_dim": 128, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10323, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.614829421043396, 0.7034120559692383, 0.73884516954422, 0.7618110179901123, 0.7788714170455933, 0.780183732509613, 0.7913385629653931, 0.7867454290390015, 0.7926509380340576, 0.7926509380340576, 0.7952755689620972, 0.7933070659637451, 0.7979002594947815, 0.7933070659637451, 0.7913385629653931, 0.7926509380340576, 0.7906824350357056, 0.7900262475013733, 0.7900262475013733, 0.7847769260406494, 0.7847769260406494, 0.7841207385063171, 0.7828084230422974, 0.7900262475013733, 0.7841207385063171, 0.7834645509719849, 0.7828084230422974, 0.7795275449752808, 0.7821522355079651, 0.7821522355079651], "test_performance": ["61.51%", "70.03%", "74.66%", "76.34%", "77.14%", "77.35%", "78.15%", "78.12%", "78.73%", "78.49%", "78.82%", "78.79%", "79.07%", "78.95%", "78.64%", "78.92%", "78.64%", "78.49%", "78.15%", "78.21%", "78.09%", "78.12%", "77.84%", "77.87%", "77.78%", "77.44%", "77.78%", "77.29%", "77.26%", "77.02%"]}}, "2020-04-11 16:08:21.698379": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 20, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10338, "output_dim": 256, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10338, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.6673228144645691, 0.7290025949478149, 0.7434383034706116, 0.778215229511261, 0.787401556968689, 0.7965879440307617, 0.8005249500274658, 0.8031495809555054, 0.7965879440307617, 0.7985564470291138, 0.7939632534980774, 0.7919947504997253, 0.7828084230422974, 0.780183732509613, 0.7808399200439453, 0.780183732509613, 0.7841207385063171, 0.7841207385063171, 0.7821522355079651, 0.7736220359802246], "test_performance": ["67.61%", "73.80%", "75.48%", "77.54%", "77.78%", "78.24%", "78.82%", "78.61%", "78.46%", "78.79%", "78.36%", "78.49%", "77.90%", "77.54%", "77.47%", "77.66%", "77.69%", "77.17%", "77.23%", "76.92%"]}}, "2020-04-11 16:12:47.007040": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 20, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10332, "output_dim": 128, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10332, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [10], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.6515747904777527, 0.7559055089950562, 0.7887139320373535, 0.7979002594947815, 0.7992125749588013, 0.787401556968689, 0.8005249500274658, 0.7742782235145569, 0.7769029140472412, 0.7834645509719849, 0.7814960479736328, 0.76115483045578, 0.7683727145195007, 0.7250655889511108, 0.7716535329818726, 0.7690288424491882, 0.7670603394508362, 0.7618110179901123, 0.7486876845359802, 0.7565616965293884], "test_performance": ["65.86%", "73.86%", "76.86%", "77.78%", "77.35%", "76.28%", "77.29%", "74.35%", "75.15%", "76.46%", "76.10%", "73.77%", "75.61%", "70.09%", "75.51%", "75.33%", "75.15%", "75.30%", "73.52%", "74.62%"]}}, "2020-04-11 16:14:11.016448": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 20, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 9578, "output_dim": 128, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 9578, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5715222954750061, 0.6377952694892883, 0.7290025949478149, 0.7467191815376282, 0.8044619560241699, 0.7992125749588013, 0.8024934530258179, 0.8103674650192261, 0.8070865869522095, 0.8070865869522095, 0.8057742714881897, 0.8024934530258179, 0.8044619560241699, 0.8011810779571533, 0.8005249500274658, 0.7985564470291138, 0.8005249500274658, 0.789370059967041, 0.7880577445030212, 0.787401556968689], "test_performance": ["57.25%", "63.53%", "73.06%", "74.35%", "78.15%", "78.24%", "78.61%", "79.22%", "79.41%", "79.44%", "79.41%", "79.10%", "79.53%", "79.59%", "79.50%", "79.01%", "79.19%", "77.90%", "78.21%", "78.18%"]}}, "2020-04-11 16:14:37.341143": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 20, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 12173, "output_dim": 128, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 12173, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5708661675453186, 0.6220472455024719, 0.6889764070510864, 0.7513123154640198, 0.7985564470291138, 0.7860892415046692, 0.8070865869522095, 0.8051180839538574, 0.8044619560241699, 0.8057742714881897, 0.8077427744865417, 0.8077427744865417, 0.8018372654914856, 0.8018372654914856, 0.7998687624931335, 0.7946194410324097, 0.7926509380340576, 0.7900262475013733, 0.7926509380340576, 0.7933070659637451], "test_performance": ["57.22%", "62.30%", "68.83%", "74.93%", "78.46%", "77.63%", "79.16%", "79.31%", "79.59%", "79.71%", "79.53%", "79.50%", "79.22%", "79.28%", "79.10%", "78.95%", "78.33%", "78.49%", "79.37%", "79.01%"]}}, "2020-04-11 16:15:25.588092": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": false, "remove_not_alpha": false, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 20, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 13655, "output_dim": 128, "input_length": 38}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 38], "dtype": "float32", "input_dim": 13655, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 38}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5702099800109863, 0.6076115369796753, 0.6640419960021973, 0.7736220359802246, 0.780183732509613, 0.789370059967041, 0.7913385629653931, 0.7965879440307617, 0.7946194410324097, 0.8038057684898376, 0.7979002594947815, 0.8018372654914856, 0.8044619560241699, 0.806430459022522, 0.8057742714881897, 0.806430459022522, 0.7959317564964294, 0.8051180839538574, 0.8018372654914856, 0.8005249500274658], "test_performance": ["57.13%", "60.44%", "66.53%", "75.61%", "76.62%", "77.72%", "78.79%", "79.47%", "79.41%", "80.02%", "79.28%", "79.74%", "79.93%", "79.59%", "79.59%", "79.47%", "78.42%", "79.74%", "79.59%", "79.80%"]}}, "2020-04-11 16:15:57.621426": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": false, "remove_not_alpha": false, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 20, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 13647, "output_dim": 128, "input_length": 38}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 38], "dtype": "float32", "input_dim": 13647, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 38}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5702099800109863, 0.6154855489730835, 0.6968504190444946, 0.7434383034706116, 0.7670603394508362, 0.7637795209884644, 0.7683727145195007, 0.7736220359802246, 0.7723097205162048, 0.7775590419769287, 0.7867454290390015, 0.7887139320373535, 0.7631233334541321, 0.7808399200439453, 0.7808399200439453, 0.7709974050521851, 0.780183732509613, 0.7729659080505371, 0.7696850299835205, 0.7709974050521851], "test_performance": ["57.13%", "61.57%", "70.06%", "75.88%", "79.10%", "78.49%", "79.25%", "79.77%", "79.90%", "79.99%", "79.37%", "79.37%", "79.31%", "79.71%", "79.77%", "79.83%", "79.87%", "79.71%", "79.68%", "79.68%"]}}, "2020-04-11 16:16:54.223529": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": false, "remove_not_alpha": false, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 20, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 7633, "output_dim": 128, "input_length": 35}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 35], "dtype": "float32", "input_dim": 7633, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 35}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5715222954750061, 0.6076115369796753, 0.7132545709609985, 0.7401574850082397, 0.7703412175178528, 0.7880577445030212, 0.789370059967041, 0.7965879440307617, 0.7952755689620972, 0.8005249500274658, 0.8038057684898376, 0.8005249500274658, 0.806430459022522, 0.8018372654914856, 0.8136482834815979, 0.8018372654914856, 0.8143044710159302, 0.8123359680175781, 0.8070865869522095, 0.8090550899505615], "test_performance": ["57.16%", "61.11%", "69.66%", "72.17%", "75.48%", "76.71%", "76.71%", "78.06%", "79.19%", "78.67%", "78.73%", "79.53%", "79.53%", "79.53%", "79.59%", "79.68%", "79.44%", "79.53%", "79.37%", "79.25%"]}}, "2020-04-11 16:17:50.696496": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": false, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": false, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 20, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 13581, "output_dim": 128, "input_length": 27}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 27], "dtype": "float32", "input_dim": 13581, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 27}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5734907984733582, 0.6003937125205994, 0.6942257285118103, 0.712598443031311, 0.7650918364524841, 0.7703412175178528, 0.7939632534980774, 0.7998687624931335, 0.8051180839538574, 0.8070865869522095, 0.8057742714881897, 0.8011810779571533, 0.7926509380340576, 0.8024934530258179, 0.7880577445030212, 0.7880577445030212, 0.7860892415046692, 0.7834645509719849, 0.7828084230422974, 0.7965879440307617], "test_performance": ["57.37%", "60.44%", "68.92%", "70.86%", "75.39%", "75.91%", "77.81%", "79.01%", "79.44%", "79.41%", "79.62%", "79.41%", "79.16%", "79.77%", "79.22%", "79.28%", "78.73%", "78.03%", "77.81%", "79.56%"]}}, "2020-04-11 16:18:22.351688": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": false, "unslang": true, "split_words": true, "stem": false, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 20, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 12862, "output_dim": 128, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 12862, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5702099800109863, 0.635170578956604, 0.6811023354530334, 0.76115483045578, 0.7709974050521851, 0.8011810779571533, 0.8103674650192261, 0.8090550899505615, 0.8103674650192261, 0.8143044710159302, 0.8097112774848938, 0.806430459022522, 0.7985564470291138, 0.7979002594947815, 0.7913385629653931, 0.7926509380340576, 0.8038057684898376, 0.7716535329818726, 0.7880577445030212, 0.7788714170455933], "test_performance": ["57.13%", "63.38%", "68.25%", "74.90%", "76.13%", "78.58%", "79.22%", "78.98%", "79.07%", "79.13%", "79.47%", "79.07%", "78.76%", "78.76%", "78.52%", "78.95%", "78.61%", "77.90%", "78.21%", "77.87%"]}}, "2020-04-11 16:19:13.428685": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 20, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 9555, "output_dim": 128, "input_length": 21}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 21], "dtype": "float32", "input_dim": 9555, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 21}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5741469860076904, 0.6548556685447693, 0.7342519760131836, 0.7854330539703369, 0.7913385629653931, 0.8005249500274658, 0.7959317564964294, 0.8051180839538574, 0.8038057684898376, 0.8024934530258179, 0.8018372654914856, 0.7959317564964294, 0.7992125749588013, 0.7992125749588013, 0.7919947504997253, 0.789370059967041, 0.787401556968689, 0.787401556968689, 0.7795275449752808, 0.780183732509613], "test_performance": ["57.74%", "65.86%", "72.91%", "77.44%", "77.54%", "78.39%", "78.12%", "79.10%", "78.92%", "79.50%", "79.22%", "78.58%", "78.98%", "79.16%", "78.64%", "78.58%", "78.24%", "78.12%", "77.75%", "77.60%"]}}, "2020-04-11 16:42:19.759973": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 20, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10855, "output_dim": 128, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10855, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "val_accuracy": [0.5728346705436707, 0.6437007784843445, 0.7270340919494629, 0.7539370059967041, 0.7709974050521851, 0.7952755689620972, 0.7992125749588013, 0.7880577445030212, 0.8057742714881897, 0.8077427744865417, 0.806430459022522, 0.8057742714881897, 0.7992125749588013, 0.7972440719604492, 0.7933070659637451, 0.7985564470291138, 0.7933070659637451, 0.7834645509719849, 0.7952755689620972, 0.7939632534980774], "test_performance": ["57.25%", "64.63%", "72.30%", "75.39%", "77.05%", "78.46%", "78.30%", "78.36%", "78.95%", "79.37%", "79.53%", "79.19%", "79.04%", "78.85%", "78.70%", "78.82%", "78.88%", "78.00%", "78.52%", "78.42%"]}}, "2020-04-11 16:43:11.892447": {"data": {"TRAIN_PERCENTAGE": 0.8, "SHUFFLE_DATA": true, "PREPROCESS_OPTRIONS": {"remove_links": true, "remove_users": true, "remove_hash": true, "unslang": true, "split_words": true, "stem": true, "remove_punctuations": true, "remove_numbers": true, "to_lower_case": true, "remove_stop_words": true, "remove_not_alpha": true, "join": false}}, "model": {"BATCH_SIZE": 512, "EPOCHS": 20, "VERBOSE": 1, "OPTIMIZER": "rmsprop", "SHUFFLE": true, "EMBEDDING_OPTIONS": {"input_dim": 10855, "output_dim": 256, "input_length": 23}, "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "input_dim": 10855, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 23}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, 