{
  "2020-05-02 15:32:21.315541": {
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 10,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12175,
        "output_dim": 256,
        "input_length": 22
      },
      "TYPE": "RCNN",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                22
              ],
              "dtype": "float32",
              "input_dim": 12175,
              "output_dim": 256,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 22
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.25,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                5
              ],
              "strides": [
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d",
              "trainable": true,
              "dtype": "float32",
              "strides": [
                4
              ],
              "pool_size": [
                4
              ],
              "padding": "valid",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_3",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.67489,
          0.65429,
          0.61925,
          0.57425,
          0.51073,
          0.43337,
          0.36821,
          0.32622,
          0.29946,
          0.27881
        ],
        "accuracy": [
          0.57356,
          0.59951,
          0.66453,
          0.71461,
          0.77094,
          0.82282,
          0.85517,
          0.87176,
          0.88128,
          0.89113
        ],
        "val_loss": [
          0.66655,
          0.64239,
          0.60992,
          0.56919,
          0.52867,
          0.4724,
          0.44878,
          0.44868,
          0.45321,
          0.4751
        ],
        "val_accuracy": [
          0.57715,
          0.61392,
          0.66513,
          0.70978,
          0.761,
          0.77544,
          0.79514,
          0.80368,
          0.80565,
          0.79383
        ],
        "test_loss": [
          0.66687,
          0.6422,
          0.60988,
          0.57182,
          0.53348,
          0.48286,
          0.4636,
          0.4673,
          0.47134,
          0.48621
        ],
        "test_accuracy": [
          0.57095,
          0.6258,
          0.68986,
          0.71315,
          0.75575,
          0.77475,
          0.78701,
          0.7913,
          0.79191,
          0.7821
        ]
      }
    }
  },
  "2020-05-02 15:32:58.121995": {
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 10,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12175,
        "output_dim": 128,
        "input_length": 22
      },
      "TYPE": "RCNN",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                22
              ],
              "dtype": "float32",
              "input_dim": 12175,
              "output_dim": 128,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 22
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.25,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                5
              ],
              "strides": [
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d",
              "trainable": true,
              "dtype": "float32",
              "strides": [
                4
              ],
              "pool_size": [
                4
              ],
              "padding": "valid",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_3",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.67947,
          0.66089,
          0.63136,
          0.58772,
          0.53195,
          0.46522,
          0.40348,
          0.35948,
          0.32619,
          0.30584
        ],
        "accuracy": [
          0.57389,
          0.58292,
          0.64516,
          0.70296,
          0.75468,
          0.80722,
          0.83842,
          0.85337,
          0.86847,
          0.87816
        ],
        "val_loss": [
          0.67177,
          0.65187,
          0.61797,
          0.58052,
          0.53819,
          0.49912,
          0.46966,
          0.45353,
          0.45036,
          0.44858
        ],
        "val_accuracy": [
          0.57649,
          0.60538,
          0.66973,
          0.70256,
          0.7367,
          0.77282,
          0.78529,
          0.79711,
          0.79974,
          0.80368
        ],
        "test_loss": [
          0.67199,
          0.65142,
          0.6174,
          0.58026,
          0.53896,
          0.50124,
          0.47467,
          0.46016,
          0.45749,
          0.45541
        ],
        "test_accuracy": [
          0.57033,
          0.61692,
          0.68465,
          0.71345,
          0.73705,
          0.76617,
          0.78057,
          0.78517,
          0.79038,
          0.79559
        ]
      }
    }
  },
  "2020-05-02 15:35:28.264949": {
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 10,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12175,
        "output_dim": 256,
        "input_length": 22
      },
      "TYPE": "RCNN",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                22
              ],
              "dtype": "float32",
              "input_dim": 12175,
              "output_dim": 256,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 22
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.25,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [
                5
              ],
              "strides": [
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d",
              "trainable": true,
              "dtype": "float32",
              "strides": [
                4
              ],
              "pool_size": [
                4
              ],
              "padding": "valid",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_3",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 128,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.66689,
          0.62517,
          0.56333,
          0.47032,
          0.39148,
          0.33998,
          0.3085,
          0.28235,
          0.26159,
          0.23806
        ],
        "accuracy": [
          0.58144,
          0.65123,
          0.71888,
          0.79836,
          0.84072,
          0.86404,
          0.87323,
          0.88834,
          0.89869,
          0.90887
        ],
        "val_loss": [
          0.6528,
          0.60272,
          0.54739,
          0.48651,
          0.45396,
          0.44802,
          0.44819,
          0.47021,
          0.46478,
          0.47537
        ],
        "val_accuracy": [
          0.59422,
          0.68089,
          0.7216,
          0.77282,
          0.79383,
          0.8063,
          0.80893,
          0.79711,
          0.80565,
          0.80302
        ],
        "test_loss": [
          0.65174,
          0.60142,
          0.54778,
          0.49038,
          0.46289,
          0.45827,
          0.46276,
          0.47889,
          0.47416,
          0.49196
        ],
        "test_accuracy": [
          0.60343,
          0.68986,
          0.72878,
          0.77291,
          0.78455,
          0.78823,
          0.80018,
          0.78455,
          0.79099,
          0.80386
        ]
      }
    }
  },
  "2020-05-02 15:36:13.923648": {
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 10,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12175,
        "output_dim": 256,
        "input_length": 22
      },
      "TYPE": "RCNN",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                22
              ],
              "dtype": "float32",
              "input_dim": 12175,
              "output_dim": 256,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 22
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.25,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [
                5
              ],
              "strides": [
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d",
              "trainable": true,
              "dtype": "float32",
              "strides": [
                4
              ],
              "pool_size": [
                4
              ],
              "padding": "valid",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_3",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 128,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.66757,
          0.62255,
          0.55936,
          0.46648,
          0.38441,
          0.33068,
          0.29876,
          0.27556,
          0.25299,
          0.23225
        ],
        "accuracy": [
          0.57997,
          0.65255,
          0.72397,
          0.80279,
          0.84351,
          0.86601,
          0.87849,
          0.88982,
          0.90099,
          0.91133
        ],
        "val_loss": [
          0.6501,
          0.60366,
          0.55321,
          0.47979,
          0.44751,
          0.43975,
          0.4462,
          0.45086,
          0.4622,
          0.48106
        ],
        "val_accuracy": [
          0.60144,
          0.6717,
          0.74261,
          0.7807,
          0.80171,
          0.81287,
          0.81156,
          0.81024,
          0.80827,
          0.79448
        ],
        "test_loss": [
          0.64947,
          0.60355,
          0.5565,
          0.49159,
          0.46684,
          0.46495,
          0.47547,
          0.47809,
          0.49138,
          0.50244
        ],
        "test_accuracy": [
          0.61385,
          0.69139,
          0.74012,
          0.76709,
          0.78547,
          0.79283,
          0.79743,
          0.79835,
          0.79773,
          0.79007
        ]
      }
    }
  },
  "2020-05-02 15:36:55.646705": {
    "type": "HIGHEST_RCNN",
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 10,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12175,
        "output_dim": 256,
        "input_length": 22
      },
      "TYPE": "RCNN",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                22
              ],
              "dtype": "float32",
              "input_dim": 12175,
              "output_dim": 256,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 22
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.25,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [
                5
              ],
              "strides": [
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d",
              "trainable": true,
              "dtype": "float32",
              "strides": [
                4
              ],
              "pool_size": [
                4
              ],
              "padding": "valid",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_3",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 128,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.66873,
          0.62619,
          0.56373,
          0.4725,
          0.38727,
          0.33498,
          0.302,
          0.27688,
          0.25516,
          0.23653
        ],
        "accuracy": [
          0.57537,
          0.65041,
          0.71708,
          0.79475,
          0.84286,
          0.867,
          0.88194,
          0.88949,
          0.90361,
          0.90903
        ],
        "val_loss": [
          0.65197,
          0.60393,
          0.54759,
          0.48599,
          0.44778,
          0.44092,
          0.44591,
          0.448,
          0.4554,
          0.47215
        ],
        "val_accuracy": [
          0.59816,
          0.68155,
          0.73342,
          0.76034,
          0.79842,
          0.81484,
          0.80302,
          0.81353,
          0.80827,
          0.79842
        ],
        "test_loss": [
          0.65152,
          0.60434,
          0.54947,
          0.4947,
          0.46454,
          0.46466,
          0.47002,
          0.47428,
          0.48338,
          0.49751
        ],
        "test_accuracy": [
          0.61293,
          0.68066,
          0.72939,
          0.75544,
          0.78547,
          0.79804,
          0.79222,
          0.80233,
          0.7962,
          0.79865
        ]
      }
    }
  },
  "2020-05-02 15:37:35.333546": {
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 10,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12175,
        "output_dim": 256,
        "input_length": 22
      },
      "TYPE": "RCNN",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                22
              ],
              "dtype": "float32",
              "input_dim": 12175,
              "output_dim": 256,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 22
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.25,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [
                3
              ],
              "strides": [
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d",
              "trainable": true,
              "dtype": "float32",
              "strides": [
                4
              ],
              "pool_size": [
                4
              ],
              "padding": "valid",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_3",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 128,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.67555,
          0.63635,
          0.57303,
          0.48073,
          0.39449,
          0.34402,
          0.30839,
          0.28543,
          0.26488,
          0.24384
        ],
        "accuracy": [
          0.57274,
          0.63202,
          0.71938,
          0.79179,
          0.83826,
          0.86076,
          0.87685,
          0.88703,
          0.89491,
          0.90706
        ],
        "val_loss": [
          0.66388,
          0.61122,
          0.55561,
          0.49103,
          0.46133,
          0.44703,
          0.45526,
          0.46275,
          0.46268,
          0.47871
        ],
        "val_accuracy": [
          0.58306,
          0.67695,
          0.74524,
          0.77216,
          0.78004,
          0.79974,
          0.80696,
          0.79842,
          0.80236,
          0.79711
        ],
        "test_loss": [
          0.66414,
          0.61161,
          0.55683,
          0.49691,
          0.47179,
          0.46256,
          0.4744,
          0.47423,
          0.47499,
          0.48677
        ],
        "test_accuracy": [
          0.57983,
          0.67606,
          0.7346,
          0.76433,
          0.77444,
          0.79467,
          0.79375,
          0.79038,
          0.79559,
          0.79068
        ]
      }
    }
  },
  "2020-05-02 15:38:25.468082": {
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 10,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12175,
        "output_dim": 256,
        "input_length": 22
      },
      "TYPE": "RCNN",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                22
              ],
              "dtype": "float32",
              "input_dim": 12175,
              "output_dim": 256,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 22
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [
                5
              ],
              "strides": [
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d",
              "trainable": true,
              "dtype": "float32",
              "strides": [
                4
              ],
              "pool_size": [
                4
              ],
              "padding": "valid",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_3",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 128,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
