{
  "2020-05-01 15:34:13.317309": {
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 256,
      "EPOCHS": 20,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12171,
        "output_dim": 128,
        "input_length": 21
      },
      "TYPE": "LSTM_DROPOUT",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                21
              ],
              "dtype": "float32",
              "input_dim": 12171,
              "output_dim": 128,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 21
            }
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "name": "spatial_dropout1d",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.2,
              "implementation": 1
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.69027,
          0.68358,
          0.67996,
          0.67833,
          0.67529,
          0.67302,
          0.66434,
          0.64841,
          0.61639,
          0.56619,
          0.49918,
          0.43799,
          0.39951,
          0.37645,
          0.35826,
          0.34406,
          0.32339,
          0.31438,
          0.30693,
          0.29285
        ],
        "accuracy": [
          0.54877,
          0.57356,
          0.57356,
          0.57356,
          0.57356,
          0.57356,
          0.57455,
          0.58933,
          0.65172,
          0.74483,
          0.82463,
          0.83957,
          0.84828,
          0.85583,
          0.86289,
          0.86585,
          0.87537,
          0.87898,
          0.88637,
          0.889
        ],
        "val_loss": [
          0.68578,
          0.68104,
          0.67879,
          0.67722,
          0.67474,
          0.67038,
          0.6615,
          0.64392,
          0.6091,
          0.55604,
          0.51526,
          0.49101,
          0.48586,
          0.48074,
          0.48236,
          0.48164,
          0.48437,
          0.48154,
          0.48188,
          0.49028
        ],
        "val_accuracy": [
          0.57584,
          0.57584,
          0.57584,
          0.57584,
          0.57584,
          0.57584,
          0.57715,
          0.59554,
          0.66251,
          0.72817,
          0.77216,
          0.78923,
          0.80171,
          0.80499,
          0.80499,
          0.80762,
          0.79974,
          0.80302,
          0.80368,
          0.79711
        ],
        "test_loss": [
          0.68619,
          0.68184,
          0.67981,
          0.67826,
          0.67578,
          0.6713,
          0.66245,
          0.64518,
          0.61139,
          0.56032,
          0.52085,
          0.49662,
          0.49176,
          0.48734,
          0.49209,
          0.49403,
          0.49431,
          0.49513,
          0.49469,
          0.49899
        ],
        "test_accuracy": [
          0.57033,
          0.57033,
          0.57033,
          0.57033,
          0.57033,
          0.57064,
          0.57217,
          0.59117,
          0.65921,
          0.74563,
          0.76954,
          0.78363,
          0.79007,
          0.78915,
          0.78823,
          0.78823,
          0.78639,
          0.78701,
          0.78731,
          0.78762
        ]
      }
    }
  },
  "2020-05-01 15:35:09.945086": {
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 128,
      "EPOCHS": 20,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12171,
        "output_dim": 128,
        "input_length": 21
      },
      "TYPE": "LSTM_DROPOUT",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                21
              ],
              "dtype": "float32",
              "input_dim": 12171,
              "output_dim": 128,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 21
            }
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "name": "spatial_dropout1d",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.2,
              "implementation": 1
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.68708,
          0.67965,
          0.67524,
          0.66277,
          0.62178,
          0.52904,
          0.4508,
          0.41997,
          0.39127,
          0.3708,
          0.35312,
          0.34417,
          0.33223,
          0.31896,
          0.3056,
          0.2967,
          0.28517,
          0.27452,
          0.2605,
          0.25046
        ],
        "accuracy": [
          0.56453,
          0.57356,
          0.57356,
          0.57586,
          0.65041,
          0.77898,
          0.82053,
          0.8243,
          0.84401,
          0.8514,
          0.86043,
          0.86256,
          0.87192,
          0.88079,
          0.88095,
          0.889,
          0.89261,
          0.90213,
          0.90279,
          0.90837
        ],
        "val_loss": [
          0.68099,
          0.67727,
          0.672,
          0.65339,
          0.59214,
          0.5049,
          0.48708,
          0.48222,
          0.47359,
          0.4701,
          0.47625,
          0.47178,
          0.47375,
          0.47712,
          0.47993,
          0.48302,
          0.49044,
          0.49989,
          0.50384,
          0.50867
        ],
        "val_accuracy": [
          0.57584,
          0.57584,
          0.57584,
          0.58043,
          0.69599,
          0.7761,
          0.7958,
          0.79777,
          0.79777,
          0.79974,
          0.79908,
          0.80368,
          0.80368,
          0.80565,
          0.8063,
          0.80171,
          0.80433,
          0.80171,
          0.80039,
          0.80171
        ],
        "test_loss": [
          0.6817,
          0.67815,
          0.67259,
          0.65345,
          0.59311,
          0.5106,
          0.49698,
          0.49243,
          0.4838,
          0.47947,
          0.48798,
          0.48196,
          0.48498,
          0.48731,
          0.49113,
          0.49155,
          0.50151,
          0.51141,
          0.51443,
          0.52036
        ],
        "test_accuracy": [
          0.57033,
          0.57033,
          0.57033,
          0.57524,
          0.69997,
          0.77505,
          0.78302,
          0.78547,
          0.78701,
          0.78486,
          0.78701,
          0.78701,
          0.78793,
          0.78884,
          0.78976,
          0.78609,
          0.78946,
          0.79099,
          0.78793,
          0.7913
        ]
      }
    }
  },
  "2020-05-01 15:36:27.076434": {
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 20,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12171,
        "output_dim": 128,
        "input_length": 21
      },
      "TYPE": "LSTM_DROPOUT",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                21
              ],
              "dtype": "float32",
              "input_dim": 12171,
              "output_dim": 128,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 21
            }
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "name": "spatial_dropout1d",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.2,
              "implementation": 1
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.68324,
          0.67733,
          0.66507,
          0.60657,
          0.49378,
          0.43725,
          0.40991,
          0.38973,
          0.36596,
          0.35168,
          0.34446,
          0.33177,
          0.32313,
          0.30722,
          0.2962,
          0.28565,
          0.27594,
          0.26502,
          0.26331,
          0.25704
        ],
        "accuracy": [
          0.57258,
          0.57373,
          0.57816,
          0.68637,
          0.78752,
          0.8179,
          0.82578,
          0.84236,
          0.8555,
          0.85977,
          0.86174,
          0.86929,
          0.87504,
          0.88177,
          0.88851,
          0.8931,
          0.89606,
          0.90197,
          0.90213,
          0.9064
        ],
        "val_loss": [
          0.67885,
          0.67374,
          0.65363,
          0.55608,
          0.49373,
          0.47314,
          0.47627,
          0.47424,
          0.46752,
          0.4632,
          0.46794,
          0.47231,
          0.47794,
          0.47855,
          0.49558,
          0.49724,
          0.49885,
          0.50805,
          0.50131,
          0.50707
        ],
        "val_accuracy": [
          0.57584,
          0.57584,
          0.58634,
          0.73211,
          0.77807,
          0.78332,
          0.79054,
          0.79383,
          0.79448,
          0.79711,
          0.7958,
          0.80039,
          0.80433,
          0.80433,
          0.80236,
          0.80499,
          0.79908,
          0.80302,
          0.80302,
          0.80565
        ],
        "test_loss": [
          0.67972,
          0.67448,
          0.65447,
          0.56164,
          0.50219,
          0.47978,
          0.48393,
          0.48468,
          0.47464,
          0.47211,
          0.47454,
          0.48014,
          0.48647,
          0.48914,
          0.50824,
          0.50707,
          0.50423,
          0.51997,
          0.51256,
          0.51154
        ],
        "test_accuracy": [
          0.57033,
          0.57033,
          0.58137,
          0.74104,
          0.77444,
          0.7818,
          0.78578,
          0.78946,
          0.78946,
          0.79314,
          0.79099,
          0.79712,
          0.79559,
          0.79712,
          0.79743,
          0.79743,
          0.79651,
          0.79712,
          0.79743,
          0.79651
        ]
      }
    }
  },
  "2020-05-01 15:37:39.678819": {
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 20,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12171,
        "output_dim": 64,
        "input_length": 21
      },
      "TYPE": "LSTM_DROPOUT",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                21
              ],
              "dtype": "float32",
              "input_dim": 12171,
              "output_dim": 64,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 21
            }
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "name": "spatial_dropout1d",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.2,
              "implementation": 1
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.68488,
          0.67876,
          0.67178,
          0.64423,
          0.5453,
          0.47309,
          0.44304,
          0.41792,
          0.3976,
          0.38416,
          0.36444,
          0.36481,
          0.34281,
          0.33312,
          0.33258,
          0.31608,
          0.30292,
          0.30001,
          0.29418,
          0.28261
        ],
        "accuracy": [
          0.57422,
          0.57356,
          0.57373,
          0.60427,
          0.75846,
          0.79655,
          0.80805,
          0.82184,
          0.83432,
          0.84631,
          0.85304,
          0.85008,
          0.8665,
          0.8711,
          0.86962,
          0.87685,
          0.88161,
          0.88604,
          0.88933,
          0.89475
        ],
        "val_loss": [
          0.67954,
          0.67593,
          0.66561,
          0.60801,
          0.52083,
          0.48386,
          0.45867,
          0.44977,
          0.44747,
          0.45537,
          0.45195,
          0.44648,
          0.4649,
          0.45801,
          0.45711,
          0.47197,
          0.45807,
          0.47235,
          0.47874,
          0.47969
        ],
        "val_accuracy": [
          0.57584,
          0.57584,
          0.57584,
          0.67498,
          0.7807,
          0.7912,
          0.79383,
          0.79842,
          0.80236,
          0.80565,
          0.80433,
          0.80302,
          0.80302,
          0.80171,
          0.80236,
          0.79974,
          0.80433,
          0.80236,
          0.80762,
          0.80893
        ],
        "test_loss": [
          0.68056,
          0.6772,
          0.66729,
          0.61383,
          0.54898,
          0.51681,
          0.49219,
          0.4815,
          0.47829,
          0.48699,
          0.48137,
          0.47194,
          0.49553,
          0.48565,
          0.48267,
          0.49683,
          0.48167,
          0.49873,
          0.50359,
          0.50402
        ],
        "test_accuracy": [
          0.57033,
          0.57033,
          0.57095,
          0.68189,
          0.76065,
          0.76678,
          0.77904,
          0.78302,
          0.78823,
          0.78762,
          0.78915,
          0.79222,
          0.79099,
          0.79099,
          0.79222,
          0.78915,
          0.79068,
          0.79283,
          0.79038,
          0.7916
        ]
      }
    }
  },
  "2020-05-01 15:38:43.884491": {
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 20,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12171,
        "output_dim": 64,
        "input_length": 21
      },
      "TYPE": "LSTM_DROPOUT",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                21
              ],
              "dtype": "float32",
              "input_dim": 12171,
              "output_dim": 64,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 21
            }
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "name": "spatial_dropout1d",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 32,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.2,
              "implementation": 1
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.68502,
          0.68101,
          0.67818,
          0.67258,
          0.65499,
          0.60448,
          0.51759,
          0.46098,
          0.44275,
          0.41903,
          0.39851,
          0.38728,
          0.37361,
          0.36476,
          0.35308,
          0.34904,
          0.33254,
          0.3206,
          0.31384,
          0.30716
        ],
        "accuracy": [
          0.57225,
          0.57356,
          0.57356,
          0.57356,
          0.58473,
          0.67931,
          0.78883,
          0.80821,
          0.8156,
          0.82611,
          0.83727,
          0.84548,
          0.84959,
          0.86059,
          0.86158,
          0.8688,
          0.87586,
          0.8798,
          0.88079,
          0.88555
        ],
        "val_loss": [
          0.68133,
          0.67897,
          0.67644,
          0.66935,
          0.64441,
          0.57629,
          0.50551,
          0.48669,
          0.47753,
          0.47866,
          0.4679,
          0.46816,
          0.46406,
          0.46736,
          0.46169,
          0.46377,
          0.47263,
          0.46986,
          0.4766,
          0.47548
        ],
        "val_accuracy": [
          0.57584,
          0.57584,
          0.57584,
          0.57584,
          0.59094,
          0.70716,
          0.78004,
          0.78135,
          0.78923,
          0.78792,
          0.79186,
          0.79645,
          0.79317,
          0.78923,
          0.79711,
          0.79842,
          0.80302,
          0.80039,
          0.80105,
          0.80171
        ],
        "test_loss": [
          0.68218,
          0.68,
          0.6774,
          0.67022,
          0.64525,
          0.57819,
          0.50638,
          0.48603,
          0.47733,
          0.48034,
          0.46639,
          0.46791,
          0.46621,
          0.47234,
          0.46601,
          0.46824,
          0.4763,
          0.47614,
          0.48363,
          0.48163
        ],
        "test_accuracy": [
          0.57033,
          0.57033,
          0.57033,
          0.57033,
          0.58995,
          0.70947,
          0.78425,
          0.78639,
          0.79252,
          0.78793,
          0.7913,
          0.79589,
          0.79651,
          0.79651,
          0.79681,
          0.79957,
          0.79743,
          0.8011,
          0.79773,
          0.79835
        ]
      }
    }
  },
  "2020-05-01 16:19:16.676640": {
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 20,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12175,
        "output_dim": 128,
        "input_length": 22
      },
      "TYPE": "LSTM_DROPOUT",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                22
              ],
              "dtype": "float32",
              "input_dim": 12175,
              "output_dim": 128,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 22
            }
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "name": "spatial_dropout1d",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 32,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.2,
              "implementation": 1
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.6899,
          0.67826,
          0.67254,
          0.65795,
          0.62461,
          0.55715,
          0.48156,
          0.44187,
          0.41256,
          0.39065,
          0.37423,
          0.35945,
          0.35646,
          0.33714,
          0.32532,
          0.3124,
          0.30425,
          0.29565,
          0.28532,
          0.28206
        ],
        "accuracy": [
          0.52348,
          0.57373,
          0.57422,
          0.58358,
          0.65895,
          0.75961,
          0.8023,
          0.82184,
          0.83777,
          0.84713,
          0.85271,
          0.86256,
          0.86437,
          0.87192,
          0.88046,
          0.88374,
          0.89015,
          0.89392,
          0.89672,
          0.89984
        ],
        "val_loss": [
          0.68058,
          0.67565,
          0.66765,
          0.64719,
          0.59796,
          0.534,
          0.49863,
          0.48231,
          0.46866,
          0.46278,
          0.46251,
          0.45952,
          0.45507,
          0.46004,
          0.46629,
          0.46622,
          0.48053,
          0.47829,
          0.4799,
          0.48907
        ],
        "val_accuracy": [
          0.57584,
          0.57584,
          0.57584,
          0.59225,
          0.68615,
          0.77019,
          0.78004,
          0.77807,
          0.7958,
          0.79842,
          0.79842,
          0.80565,
          0.80959,
          0.80959,
          0.80433,
          0.80827,
          0.80696,
          0.80696,
          0.8063,
          0.80959
        ],
        "test_loss": [
          0.68128,
          0.67648,
          0.66809,
          0.64761,
          0.60033,
          0.53922,
          0.50351,
          0.48847,
          0.47974,
          0.47816,
          0.4763,
          0.47789,
          0.47337,
          0.47853,
          0.48109,
          0.48623,
          0.49608,
          0.49295,
          0.49752,
          0.50294
        ],
        "test_accuracy": [
          0.57033,
          0.57033,
          0.57095,
          0.58658,
          0.70518,
          0.76923,
          0.77996,
          0.78854,
          0.79252,
          0.7916,
          0.79497,
          0.79712,
          0.79681,
          0.79865,
          0.80018,
          0.79804,
          0.80049,
          0.79896,
          0.79926,
          0.79804
        ]
      }
    }
  },
  "2020-05-01 16:21:38.511952": {
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": false,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": false,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": false,
        "remove_not_alpha": false,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 20,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 13344,
        "output_dim": 128,
        "input_length": 39
      },
      "TYPE": "LSTM_DROPOUT",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [
                null,
                39
              ],
              "dtype": "float32",
              "input_dim": 13344,
              "output_dim": 128,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 39
            }
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "name": "spatial_dropout1d",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 32,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.2,
              "implementation": 1
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.68765,
          0.68358,
          0.68302,
          0.68257,
          0.68183,
          0.67884,
          0.64985,
          0.58438,
          0.53243,
          0.50088,
          0.48361,
          0.4634,
          0.44965,
          0.43438,
          0.42408,
          0.41711,
          0.40821,
          0.39597,
          0.3881,
          0.3726
        ],
        "accuracy": [
          0.55583,
          0.57356,
          0.57356,
          0.57356,
          0.57356,
          0.57356,
          0.59343,
          0.71576,
          0.77422,
          0.79392,
          0.80328,
          0.81478,
          0.82299,
          0.82989,
          0.83892,
          0.84105,
          0.8486,
          0.85287,
          0.85649,
          0.86847
        ],
        "val_loss": [
          0.68292,
          0.68185,
          0.68187,
          0.6816,
          0.68038,
          0.67417,
          0.61497,
          0.55329,
          0.5383,
          0.5208,
          0.51891,
          0.51612,
          0.50908,
          0.50558,
          0.50391,
          0.49071,
          0.484,
          0.48335,
          0.4782,
          0.48476
        ],
        "val_accuracy": [
          0.57584,
          0.57584,
          0.57584,
          0.57584,
          0.57584,
          0.57584,
          0.64806,
          0.75903,
          0.7715,
          0.76494,
          0.77676,
          0.7807,
          0.78464,
          0.78661,
          0.78923,
          0.79908,
          0.80433,
          0.80565,
          0.80236,
          0.80368
        ],
        "test_loss": [
          0.68397,
          0.68326,
          0.68318,
          0.68294,
          0.68204,
          0.67594,
          0.61754,
          0.5562,
          0.5416,
          0.52372,
          0.52166,
          0.51794,
          0.51363,
          0.50768,
          0.51078,
          0.49938,
          0.49869,
          0.49863,
          0.49638,
          0.50602
        ],
        "test_accuracy": [
          0.57033,
          0.57033,
          0.57033,
          0.57033,
          0.57033,
          0.57033,
          0.64481,
          0.75881,
          0.7677,
          0.76279,
          0.77107,
          0.77659,
          0.78149,
          0.78486,
          0.78547,
          0.79038,
          0.79191,
          0.79436,
          0.79528,
          0.79191
        ]
      }
    }
  },
  "2020-05-01 16:23:51.961249": {
    "target": "keras",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": false,
        "add_hash_flag": false,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": false,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": false,
        "remove_not_alpha": false,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 20,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12743,
        "output_dim": 128,
