{
  "2020-05-03 11:43:22.041172": {
    "target": "keras-glove",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      },
      "GLOVE_SIZE": 200,
      "GLOVE": "glove.twitter.27B.200d.txt"
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 15,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12175,
        "output_dim": 200,
        "input_length": 22,
        "embeddings_initializer": "{\"class_name\": \"Constant\"}",
        "trainable": false
      },
      "TYPE": "LSTM",
      "vocab_coverage": 0.8910793494332183,
      "text_coverage": 0.9679486150140506,
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": false,
              "batch_input_shape": [
                null,
                22
              ],
              "dtype": "float32",
              "input_dim": 12175,
              "output_dim": 200,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "{\"class_name\": \"ndarray\"}"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 22
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 50,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.68296,
          0.61066,
          0.49851,
          0.46512,
          0.45166,
          0.44111,
          0.43228,
          0.42448,
          0.41786,
          0.41186,
          0.40636,
          0.4011,
          0.39592,
          0.39139,
          0.38685
        ],
        "accuracy": [
          0.62479,
          0.74893,
          0.78325,
          0.79573,
          0.79984,
          0.80427,
          0.81002,
          0.81544,
          0.82315,
          0.82365,
          0.82808,
          0.83071,
          0.833,
          0.83645,
          0.84007
        ],
        "val_loss": [
          0.66447,
          0.54378,
          0.47275,
          0.45526,
          0.44531,
          0.44196,
          0.43197,
          0.42941,
          0.42749,
          0.42332,
          0.42258,
          0.42062,
          0.42245,
          0.41833,
          0.42175
        ],
        "val_accuracy": [
          0.70125,
          0.78529,
          0.79645,
          0.8063,
          0.8063,
          0.80696,
          0.81812,
          0.81747,
          0.81353,
          0.82009,
          0.81878,
          0.81681,
          0.81812,
          0.81944,
          0.81747
        ],
        "test_loss": [
          0.66354,
          0.54927,
          0.49113,
          0.47782,
          0.46779,
          0.4653,
          0.45582,
          0.45189,
          0.45145,
          0.446,
          0.44505,
          0.44358,
          0.44777,
          0.44293,
          0.44802
        ],
        "test_accuracy": [
          0.70978,
          0.77383,
          0.78363,
          0.78854,
          0.79497,
          0.7962,
          0.80233,
          0.80386,
          0.80356,
          0.80601,
          0.80417,
          0.80233,
          0.80417,
          0.80693,
          0.80447
        ]
      }
    }
  },
  "2020-05-03 11:46:02.776641": {
    "target": "keras-glove",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      },
      "GLOVE_SIZE": 100,
      "GLOVE": "glove.twitter.27B.100d.txt"
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 15,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12175,
        "output_dim": 100,
        "input_length": 22,
        "embeddings_initializer": "{\"class_name\": \"Constant\"}",
        "trainable": false
      },
      "TYPE": "LSTM",
      "vocab_coverage": 0.8910793494332183,
      "text_coverage": 0.9679486150140506,
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": false,
              "batch_input_shape": [
                null,
                22
              ],
              "dtype": "float32",
              "input_dim": 12175,
              "output_dim": 100,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "{\"class_name\": \"ndarray\"}"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 22
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 25,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.68981,
          0.6779,
          0.6511,
          0.59621,
          0.52805,
          0.48667,
          0.47194,
          0.46478,
          0.45905,
          0.45418,
          0.44972,
          0.44549,
          0.44142,
          0.43748,
          0.43347
        ],
        "accuracy": [
          0.58325,
          0.65287,
          0.71133,
          0.76338,
          0.78424,
          0.79458,
          0.79589,
          0.79852,
          0.80099,
          0.80378,
          0.80608,
          0.80788,
          0.81149,
          0.81379,
          0.81576
        ],
        "val_loss": [
          0.68543,
          0.67073,
          0.6341,
          0.56954,
          0.50797,
          0.48467,
          0.47459,
          0.46977,
          0.46547,
          0.46234,
          0.45947,
          0.45643,
          0.45394,
          0.45208,
          0.45184
        ],
        "val_accuracy": [
          0.62049,
          0.66513,
          0.72948,
          0.77479,
          0.78923,
          0.79054,
          0.78989,
          0.7958,
          0.79514,
          0.79777,
          0.79908,
          0.79645,
          0.79974,
          0.79711,
          0.79514
        ],
        "test_loss": [
          0.68405,
          0.66887,
          0.63188,
          0.56881,
          0.51309,
          0.49505,
          0.4878,
          0.48356,
          0.47999,
          0.47639,
          0.47325,
          0.47027,
          0.46775,
          0.46577,
          0.46536
        ],
        "test_accuracy": [
          0.64726,
          0.6874,
          0.74104,
          0.77352,
          0.7818,
          0.78057,
          0.78609,
          0.78884,
          0.78639,
          0.78854,
          0.79344,
          0.79375,
          0.79835,
          0.79497,
          0.79559
        ]
      }
    }
  },
  "2020-05-03 11:49:23.623325": {
    "target": "keras-glove",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": false,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": false,
        "remove_not_alpha": false,
        "join": false
      },
      "GLOVE_SIZE": 200,
      "GLOVE": "glove.twitter.27B.200d.txt"
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 15,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12747,
        "output_dim": 200,
        "input_length": 39,
        "embeddings_initializer": "{\"class_name\": \"Constant\"}",
        "trainable": false
      },
      "TYPE": "LSTM",
      "vocab_coverage": 0.866624823474031,
      "text_coverage": 0.9585933506303108,
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": false,
              "batch_input_shape": [
                null,
                39
              ],
              "dtype": "float32",
              "input_dim": 12747,
              "output_dim": 200,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "{\"class_name\": \"ndarray\"}"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 39
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 50,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.68703,
          0.64046,
          0.55713,
          0.50372,
          0.47481,
          0.45892,
          0.44639,
          0.4389,
          0.43083,
          0.42562,
          0.4199,
          0.41477,
          0.40979,
          0.40597,
          0.40215
        ],
        "accuracy": [
          0.57077,
          0.63875,
          0.7555,
          0.78243,
          0.79852,
          0.8069,
          0.81264,
          0.81724,
          0.82167,
          0.82677,
          0.82824,
          0.83317,
          0.83432,
          0.83744,
          0.83826
        ],
        "val_loss": [
          0.67675,
          0.59868,
          0.54321,
          0.50846,
          0.49136,
          0.48353,
          0.48191,
          0.46476,
          0.46165,
          0.45662,
          0.45429,
          0.45215,
          0.45627,
          0.45286,
          0.4587
        ],
        "val_accuracy": [
          0.57584,
          0.72292,
          0.75706,
          0.76494,
          0.77938,
          0.79186,
          0.78661,
          0.79448,
          0.79974,
          0.80433,
          0.80171,
          0.80368,
          0.80499,
          0.80105,
          0.78858
        ],
        "test_loss": [
          0.67873,
          0.59952,
          0.54367,
          0.51273,
          0.49553,
          0.48673,
          0.48847,
          0.47178,
          0.46917,
          0.46428,
          0.46207,
          0.46086,
          0.46453,
          0.46127,
          0.46635
        ],
        "test_accuracy": [
          0.57033,
          0.72786,
          0.76279,
          0.7723,
          0.77751,
          0.78854,
          0.77751,
          0.79589,
          0.79804,
          0.79865,
          0.8011,
          0.79926,
          0.8011,
          0.79957,
          0.7916
        ]
      }
    }
  },
  "2020-05-03 11:51:41.929197": {
    "target": "keras-glove",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": false,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": false,
        "remove_not_alpha": false,
        "join": false
      },
      "GLOVE_SIZE": 100,
      "GLOVE": "glove.twitter.27B.100d.txt"
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 15,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12747,
        "output_dim": 100,
        "input_length": 39,
        "embeddings_initializer": "{\"class_name\": \"Constant\"}",
        "trainable": false
      },
      "TYPE": "LSTM",
      "vocab_coverage": 0.866624823474031,
      "text_coverage": 0.9585933506303108,
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": false,
              "batch_input_shape": [
                null,
                39
              ],
              "dtype": "float32",
              "input_dim": 12747,
              "output_dim": 100,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "{\"class_name\": \"ndarray\"}"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 39
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 25,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.691,
          0.68476,
          0.6745,
          0.65247,
          0.61403,
          0.58044,
          0.55493,
          0.53408,
          0.51623,
          0.50058,
          0.48776,
          0.47792,
          0.46881,
          0.46177,
          0.45535
        ],
        "accuracy": [
          0.55616,
          0.57356,
          0.57356,
          0.57504,
          0.66732,
          0.74401,
          0.75632,
          0.76453,
          0.77028,
          0.78243,
          0.7913,
          0.79212,
          0.79901,
          0.80099,
          0.80427
        ],
        "val_loss": [
          0.68812,
          0.6805,
          0.6667,
          0.63574,
          0.598,
          0.57265,
          0.55212,
          0.53537,
          0.51729,
          0.50196,
          0.49059,
          0.48424,
          0.47392,
          0.46811,
          0.46664
        ],
        "val_accuracy": [
          0.57584,
          0.57584,
          0.57584,
          0.58175,
          0.72882,
          0.74327,
          0.74787,
          0.75509,
          0.77347,
          0.78201,
          0.78858,
          0.78989,
          0.79974,
          0.80105,
          0.79645
        ],
        "test_loss": [
          0.68872,
          0.6823,
          0.66968,
          0.63858,
          0.60175,
          0.57706,
          0.55843,
          0.54462,
          0.532,
          0.52115,
          0.51265,
          0.5066,
          0.49796,
          0.49242,
          0.49103
        ],
        "test_accuracy": [
          0.57033,
          0.57033,
          0.57033,
          0.5783,
          0.72908,
          0.73797,
          0.74533,
          0.74747,
          0.75942,
          0.76831,
          0.77659,
          0.77352,
          0.78302,
          0.78394,
          0.7821
        ]
      }
    }
  },
  "2020-05-03 11:53:57.315332": {
    "target": "keras-glove",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": false,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": false,
        "remove_not_alpha": false,
        "join": false
      },
      "GLOVE_SIZE": 100,
      "GLOVE": "glove.twitter.27B.100d.txt"
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 25,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12747,
        "output_dim": 100,
        "input_length": 39,
        "embeddings_initializer": "{\"class_name\": \"Constant\"}",
        "trainable": false
      },
      "TYPE": "LSTM",
      "vocab_coverage": 0.866624823474031,
      "text_coverage": 0.9585933506303108,
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": false,
              "batch_input_shape": [
                null,
                39
              ],
              "dtype": "float32",
              "input_dim": 12747,
              "output_dim": 100,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "{\"class_name\": \"ndarray\"}"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 39
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 25,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.68768,
          0.67915,
          0.66209,
          0.61649,
          0.5565,
          0.51974,
          0.49576,
          0.48155,
          0.47126,
          0.46418,
          0.45883,
          0.45483,
          0.45065,
          0.44719,
          0.44396,
          0.44016,
          0.43793,
          0.43439,
          0.43194,
          0.42889,
          0.42562,
          0.42361,
          0.42168,
          0.41989,
          0.41747
        ],
        "accuracy": [
          0.57225,
          0.57356,
          0.59442,
          0.72266,
          0.75189,
          0.76913,
          0.78161,
          0.79048,
          0.79787,
          0.80411,
          0.80558,
          0.80821,
          0.81002,
          0.81199,
          0.81544,
          0.81609,
          0.81593,
          0.82003,
          0.81855,
          0.8225,
          0.82282,
          0.82545,
          0.82791,
          0.82512,
          0.82972
        ],
        "val_loss": [
          0.68382,
          0.67365,
          0.64603,
          0.58889,
          0.53776,
          0.50623,
          0.48943,
          0.47971,
          0.4742,
          0.47153,
          0.46721,
          0.46454,
          0.46165,
          0.46393,
          0.45799,
          0.45752,
          0.45487,
          0.45384,
          0.45184,
          0.45041,
          0.45221,
          0.4486,
          0.45371,
          0.45053,
          0.44943
        ],
        "val_accuracy": [
          0.57584,
          0.57649,
          0.64609,
          0.75246,
          0.7715,
          0.78792,
          0.79645,
          0.80433,
          0.7958,
          0.79383,
          0.8063,
          0.81156,
          0.8063,
          0.8063,
          0.81024,
          0.8063,
          0.80827,
          0.81024,
          0.80762,
          0.80762,
          0.80827,
          0.80762,
          0.80762,
          0.80762,
          0.80893
        ],
        "test_loss": [
          0.68532,
          0.67631,
          0.6498,
          0.59435,
          0.5486,
          0.52615,
          0.51183,
          0.50376,
          0.49704,
          0.49327,
          0.4873,
          0.48476,
          0.48183,
          0.48211,
          0.47605,
          0.47347,
          0.47155,
          0.47106,
          0.46796,
          0.46719,
          0.46987,
          0.46521,
          0.47059,
          0.46785,
          0.4672
        ],
        "test_accuracy": [
          0.57033,
          0.57033,
          0.65461,
          0.73583,
          0.74625,
          0.7631,
          0.76739,
          0.77996,
          0.77475,
          0.77812,
          0.78976,
          0.79038,
          0.79068,
          0.7913,
          0.79651,
          0.79436,
          0.79743,
          0.79497,
          0.79681,
          0.79804,
          0.80018,
          0.79804,
          0.80049,
          0.80141,
          0.80233
        ]
      }
    }
  },
  "2020-05-03 11:58:36.617037": {
    "target": "keras-glove",
    "data": {
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      },
      "GLOVE_SIZE": 200,
      "GLOVE": "glove.twitter.27B.200d.txt"
    },
    "model": {
      "BATCH_SIZE": 64,
      "EPOCHS": 20,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12175,
        "output_dim": 200,
        "input_length": 22,
        "embeddings_initializer": "{\"class_name\": \"Constant\"}",
        "trainable": false
      },
      "TYPE": "LSTM",
      "vocab_coverage": 0.8910793494332183,
      "text_coverage": 0.9679486150140506,
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": false,
              "batch_input_shape": [
                null,
                22
              ],
              "dtype": "float32",
              "input_dim": 12175,
              "output_dim": 200,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "{\"class_name\": \"ndarray\"}"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 22
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 50,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.67855,
          0.58502,
          0.48006,
          0.45547,
          0.44265,
          0.43254,
          0.42383,
          0.41635,
          0.41116,
          0.40525,
          0.40009,
          0.39555,
          0.3917,
          0.38742,
          0.38365,
          0.37977,
          0.37624,
          0.37256,
          0.3685,
          0.36511
        ],
        "accuracy": [
          0.69376,
          0.77619,
          0.79458,
          0.80213,
          0.80755,
          0.8133,
          0.81741,
          0.82151,
          0.82397,
          0.82841,
          0.83284,
          0.83284,
          0.83596,
          0.83875,
          0.84204,
          0.84417,
          0.84548,
          0.8491,
          0.85057,
          0.85205
        ],
        "val_loss": [
          0.65625,
          0.51776,
          0.46958,
          0.45644,
          0.44728,
          0.43897,
          0.43419,
          0.42932,
          0.42707,
          0.42976,
          0.42493,
          0.42287,
          0.4222,
          0.4237,
          0.42369,
          0.42165,
          0.41991,
          0.42102,
          0.42351,
          0.42274
        ],
        "val_accuracy": [
          0.72095,
          0.78726,
          0.79317,
          0.80039,
          0.80039,
          0.80827,
          0.80565,
          0.81353,
          0.81878,
          0.80827,
          0.81615,
          0.81615,
          0.81747,
          0.81484,
          0.80827,
          0.8155,
          0.81156,
          0.81418,
          0.8109,
          0.81484
        ],
        "test_loss": [
          0.65612,
          0.52438,
          0.48588,
          0.47567,
          0.46801,
          0.45999,
          0.45741,
          0.45213,
          0.44982,
          0.45319,
          0.44924,
          0.44719,
          0.44662,
          0.44893,
          0.44927,
          0.44687,
          0.44559,
          0.44697,
          0.45114,
          0.45117
        ],
        "test_accuracy": [
          0.72663,
          0.77597,
          0.78425,
          0.78823,
          0.78976,
          0.79405,
          0.79467,
          0.79926,
          0.79651,
          0.79344,
          0.79497,
          0.79651,
          0.79896,
          0.80356,
          0.79926,
          0.80815,
          0.80386,
          0.80754,
          0.80478,
          0.80907
        ]
      }
    }
  },
  "2020-05-03 12:12:29.302950": {
    "target": "keras-glove",
    "data": {
      "GLOVE_SIZE": 200,
      "GLOVE": "glove.twitter.27B.200d.txt",
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": true,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": true,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 16,
      "EPOCHS": 15,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12175,
        "output_dim": 200,
        "input_length": 22,
        "embeddings_initializer": "{\"class_name\": \"Constant\"}",
        "trainable": false
      },
      "TYPE": "LSTM",
      "vocab_coverage": 0.89108,
      "text_coverage": 0.96795,
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": false,
              "batch_input_shape": [
                null,
                22
              ],
              "dtype": "float32",
              "input_dim": 12175,
              "output_dim": 200,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "{\"class_name\": \"ndarray\"}"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 22
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 50,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "history": {
        "loss": [
          0.61153,
          0.46242,
          0.43833,
          0.42305,
          0.41166,
          0.40256,
          0.39282,
          0.38695,
          0.37907,
          0.37191,
          0.36595,
          0.35977,
          0.35217,
          0.34547,
          0.33797
        ],
        "accuracy": [
          0.69228,
          0.79787,
          0.811,
          0.81691,
          0.82381,
          0.83251,
          0.83612,
          0.84023,
          0.84335,
          0.84647,
          0.85172,
          0.85287,
          0.85681,
          0.86289,
          0.8665
        ],
        "val_loss": [
          0.49384,
          0.45616,
          0.44244,
          0.43289,
          0.42776,
          0.43148,
          0.43809,
          0.42314,
          0.42246,
          0.43327,
          0.43012,
          0.43537,
          0.43211,
          0.4327,
          0.43623
        ],
        "val_accuracy": [
          0.78792,
          0.80171,
          0.8109,
          0.81287,
          0.80499,
          0.79908,
          0.81484,
          0.80893,
          0.80827,
          0.79908,
          0.80368,
          0.81287,
          0.79908,
          0.81615,
          0.81221
        ],
        "test_loss": [
          0.51255,
          0.48063,
          0.46649,
          0.45682,
          0.45046,
          0.45494,
          0.46022,
          0.44266,
          0.44073,
          0.45364,
          0.44917,
          0.45588,
          0.45344,
          0.45312,
          0.45511
        ],
        "test_accuracy": [
          0.76862,
          0.78302,
          0.79252,
          0.8011,
          0.80325,
          0.7916,
          0.79283,
          0.80999,
          0.80876,
          0.79804,
          0.80631,
          0.81091,
          0.79957,
          0.81275,
          0.81122
        ]
      }
    }
  },
  "2020-05-03 12:13:38.055045": {
    "target": "keras-glove",
    "data": {
      "GLOVE_SIZE": 200,
      "GLOVE": "glove.twitter.27B.200d.txt",
      "PREPROCESS_OPTRIONS": {
        "add_link_flag": false,
        "add_user_flag": true,
        "add_hash_flag": true,
        "add_number_flag": false,
        "add_keyword_flag": false,
        "add_location_flag": false,
        "remove_links": true,
        "remove_users": true,
        "remove_hash": true,
        "unslang": true,
        "split_words": true,
        "stem": false,
        "remove_punctuations": true,
        "remove_numbers": true,
        "to_lower_case": true,
        "remove_stop_words": true,
        "remove_not_alpha": true,
        "join": false
      }
    },
    "model": {
      "BATCH_SIZE": 16,
      "EPOCHS": 15,
      "VERBOSE": 1,
      "OPTIMIZER": "rmsprop",
      "LEARNING_RATE": 0.0001,
      "SHUFFLE": true,
      "EMBEDDING_OPTIONS": {
        "input_dim": 12173,
        "output_dim": 200,
        "input_length": 22,
        "embeddings_initializer": "{\"class_name\": \"Constant\"}",
        "trainable": false
      },
      "TYPE": "LSTM",
      "vocab_coverage": 0.89106,
      "text_coverage": 0.96399,
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": false,
              "batch_input_shape": [
                null,
                22
              ],
              "dtype": "float32",
              "input_dim": 12173,
              "output_dim": 200,
              "embeddings_initializer": {
                "class_name": "Constant",
                "config": {
                  "value": "{\"class_name\": \"ndarray\"}"
                }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 22
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_5",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 50,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_9",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
